program/Notes_pandas.org
#+TITLE: pandas
#+AUTHOR:    Karthik
#+OPTIONS: num:nil
# +OPTIONS: ^:nil p:t
# +OPTIONS: toc:nil  Timestamp: nil toc:nil date:nil author:nil
# +OPTIONS: broken-links:t
#+SETUPFILE: ~/mynotes/org2html/org-theme-collection/theme2.setup

* Resources

Youtube Corey Schafer Pandas Playlist :https://www.youtube.com/watch?v=ZyhVh-qRZPA&list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS
10 min  pandas : https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html

* Install pandas 
install pandas
#+begin_src sh
pip install pandas
pip install jupyter notebook
pip install jupyterlab
#+end_src

download data
stack Overflow Annual Developer Survey
* Import and Export
file:./pandas-sub-doc/Import-Export.html
** Import 
#+begin_src python
import pandas as pd

df = pd.read_csv('data/survey_results_public.csv')
# Set index from the file 
df = pd.read_csv('data/survey_results_public.csv',index=dates)
df = pd.read_excel(open('tmp.xlsx', 'rb'),
              sheet_name='Sheet3')
# if index is date or datetime you need to convert it datetime formate to sort or do datetime operations
df = pd.read_clipboard(sep=r"[ ]{2,}")  #https://stackoverflow.com/questions/61605415/how-can-we-resample-ohlcv-1-minute-pandas-dataframe-into-a-5-minute-dataframe
df = pf.read_html('https://simple.wikiepedia.org/wiki/List_of_U.S._states')
# TODO read from databsae : sqllite3, mysql,psql, mongodb
#+end_src
For more information on read excel [[https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#][link]]
** Export

*** Export to csv
*** Export to excel 
#+begin_src python
import openpyxl
file_rpath = '../database/option_trading-banknifty/HDFCBANK_historical_data'# os.path.splittext('/temp/test.txt'))
file_name = file_rpath+".xlsx"
# df.to_excel(file_name,sheet_name='1minute',,index=False) can't write other sheets in this file
# if we use =to_excel= to write next sheet then it will rewrite entire file and all the data will be lost 

with pd.ExcelWriter(file_name, mode="w",engine="openpyxl")as writer:
    df.to_excel(writer, sheet_name="1minute")
    df_temp =down_sample_by_minute(df,2)
    df_temp.to_excel(writer,sheet_name='2minute')
    df_temp =down_sample_by_minute(df,3)
    df_temp.to_excel(writer,sheet_name='3minute')
    df_temp =down_sample_by_minute(df,5)
    df_temp.to_excel(writer,sheet_name='5minute')
#+end_src

*** Export to html
*** Export to markdown
#+begin_src python
import numpy as np
from sklearn.datasets import load_iris
import pandas as pd
 
data = load_iris()
df = pd.DataFrame(data.data,
                  columns=data.feature_names)
 
# Converts the dataframe into str object with formatting
print(df.to_markdown())
#+end_src

*** Export to database sqllite3
#+begin_src python
from sqlalchemy import create_engine
import psycopg2

engine = create_engine('postgresql://dbuser:dbpass@localhost:5432/sample_db')

# To READ or IMPORT 
sql_df = pd.read_sql('sample_table', engine, index_col='Respondent')

# TO EXPORT or WRITE
india_df.to_sql('sample_table', engine, if_exists='replace')
#+end_src


For sqlite

https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#reading-tables

https://stackoverflow.com/questions/36028759/how-to-open-and-convert-sqlite-database-to-pandas-dataframe


#+begin_src python
import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('file.db')

df = pd.read_sql_query("SELECT * FROM table_name", cnx)
#+end_src

*** Export to org-mode or psql formate
#+begin_src python
from tabulate import tabulate
import pandas as pd

df = pd.DataFrame({'col_two' : [0.0001, 1e-005 , 1e-006, 1e-007],
                   'column_3' : ['ABCD', 'ABCD', 'long string', 'ABCD']})

print(tabulate(df, headers='keys', tablefmt='psql'))

# +----+-----------+-------------+

# |    |   col_two | column_3    |
# |----+-----------+-------------|
# |  0 |    0.0001 | ABCD        |
# |  1 |    1e-05  | ABCD        |
# |  2 |    1e-06  | long string |
# |  3 |    1e-07  | ABCD        |

# +----+-----------+-------------+

#+end_src



| 1   |   col two | column 3   |
|----+-----------+-------------|
|  0 |    0.0001 | ABCD        |
|  1 |    1e-05  | ABCD        |
|  2 |    1e-06  | long string |
|  3 |    1e-07  | ABCD        |
