program/Notes_pandas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-03-16 Thu 11:42 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>pandas</title>
<meta name="author" content="Karthik" />
<meta name="generator" content="Org Mode" />
<link rel="icon" type="image/png" href="https://deepalgorithms.in/assets/icons/favicon.png">
<link rel="stylesheet" type="text/css" href="readtheorg-htmlize.css"/>
<link rel="stylesheet" type="text/css" href="readtheorg.css"/>
</head>
<body>
<div id="content" class="content">
<h1 class="title">pandas</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgcab502c">Resources</a></li>
<li><a href="#org91c8df7">Install pandas</a></li>
<li><a href="#org0ea1bc5">Import and Export</a>
<ul>
<li><a href="#orgca56cd0">Import</a></li>
<li><a href="#org4c96a4b">Export</a>
<ul>
<li><a href="#org38ede06">Export to csv</a></li>
<li><a href="#orgaa5fb08">Export to excel</a></li>
<li><a href="#org51b61f8">Export to html</a></li>
<li><a href="#org277a2af">Export to markdown</a></li>
<li><a href="#org5b6432a">Export to database sqllite3</a></li>
<li><a href="#org9a3ed99">Export to org-mode or psql formate</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org547b84a">View</a></li>
<li><a href="#orgdb1e4cf">Create dataframe</a>
<ul>
<li><a href="#org7ee59d5">Using dictionary each <code>key is column name</code>  <code>value is list_of elements in column</code></a></li>
<li><a href="#org5fb6b32">Create Empty dataframe</a></li>
<li><a href="#org382dd3f"><span class="todo TODO">TODO</span> Create db with list of dictionary</a></li>
<li><a href="#org053537a">Create with json data or dictionary</a></li>
<li><a href="#org25ce900">Create empty column</a></li>
<li><a href="#org947b756">Add Empty Colum to existing dataframe</a></li>
</ul>
</li>
<li><a href="#orgdd2eed7">Header or Column Name or Field</a>
<ul>
<li><a href="#orgbf0579d">Get all Header or Field or Columns Name</a></li>
<li><a href="#orgc1eaf2a">rename  header or column name</a></li>
<li><a href="#org5394316">Add Empty Colum to existing dataframe</a></li>
<li><a href="#orgdce4af0">Drop or delete Column</a></li>
<li><a href="#orgd80821a">Drop Row</a></li>
</ul>
</li>
<li><a href="#orgc3f5b4e">getting data form dataframe</a>
<ul>
<li><a href="#orgb4a7f64">If index is datetime.date we can slice</a></li>
</ul>
</li>
<li><a href="#org1ab1503">Set Index</a></li>
<li><a href="#orgda64ecc">unique element in row/column</a></li>
<li><a href="#org093abe5">Inplace</a></li>
<li><a href="#orgdadc893">For loop in pandas</a></li>
<li><a href="#org2fd7005">Selection</a>
<ul>
<li><a href="#orga809d89">Lables (.loc)</a></li>
<li><a href="#orgd36adcc">iloc</a></li>
<li><a href="#org5808277">set value using iloc</a></li>
<li><a href="#orgb9f2e69">at</a></li>
<li><a href="#org01ea127">iat</a></li>
<li><a href="#org89a6adb">loc to  iloc and iloc to loc</a></li>
</ul>
</li>
<li><a href="#orgd49cb96">Filters</a>
<ul>
<li><a href="#org864b436">filter get named index</a></li>
</ul>
</li>
<li><a href="#orgad7f0fd">Update element in dataframe</a>
<ul>
<li><a href="#org91f0223">Update element in data fram</a>
<ul>
<li><a href="#org4157bc9">Using loc</a></li>
<li><a href="#orgf3a5618">Using at</a></li>
<li><a href="#org80f31d1">Using fuctions</a></li>
<li><a href="#orgf59af81">Using lambda</a></li>
<li><a href="#org63045b5">Using list compression</a></li>
<li><a href="#org8aac319">Using pandas 'apply'</a></li>
<li><a href="#org2504670">Using pandas 'applymap''</a></li>
<li><a href="#org0158c73">Using pandas 'map'</a></li>
<li><a href="#org65ae1eb">Error in map if some elements in column is not specific</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgb09e74a">Add and remove rows and columns</a>
<ul>
<li><a href="#org46bf229">Add column</a></li>
<li><a href="#orgc76b444">Remove column</a></li>
<li><a href="#orgfab6a1f">Creating column</a></li>
<li><a href="#org72af373">Add new row in dataframe using append</a></li>
<li><a href="#org0ade523">Add two dataframe in row using append</a></li>
<li><a href="#orgcdd890e">Remove row with index no or by value</a></li>
</ul>
</li>
<li><a href="#org5aa5660">Sorting-Data</a>
<ul>
<li><a href="#org4ef05ad">Sort by one column</a></li>
<li><a href="#orgc447c1a">Sort by two column</a></li>
<li><a href="#orgaa1a9ac">Sort by two column with multiple sort values</a></li>
<li><a href="#org6023230">Example 2</a>
<ul>
<li><a href="#org489c497">Sort Salary in Desending Order  based Country(in ascending Order)</a></li>
<li><a href="#org33ae2c9">Sort dataframe based on salary</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgdf9a8a5">Grouping and Aggregates</a></li>
<li><a href="#org09328da">Cleaning-Data</a></li>
<li><a href="#org081a353">pandas with datetime</a></li>
<li><a href="#org02a7e69"><span class="todo TODO">TODO</span> Join</a>
<ul>
<li><a href="#orge300cf6">Inner Join</a></li>
<li><a href="#org6ea1312">Outer Join</a></li>
<li><a href="#org7427327">Right Join</a></li>
<li><a href="#orgc76c36d">Left Join</a></li>
</ul>
</li>
<li><a href="#org18adf99"><span class="todo TODO">TODO</span> Horizontal Join</a>
<ul>
<li><a href="#orgd2cd8e3"><span class="todo TODO">TODO</span> pandas append</a></li>
<li><a href="#org450809f">pandas concat</a></li>
</ul>
</li>
<li><a href="#org93ea48f"><span class="todo TODO">TODO</span> Copy or shallow copy</a></li>
<li><a href="#orgd716fe3">Resampling</a></li>
<li><a href="#org4187643">Aggreagtes for ohlc</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgcab502c" class="outline-2">
<h2 id="orgcab502c">Resources</h2>
<div class="outline-text-2" id="text-orgcab502c">
<p>
Youtube Corey Schafer Pandas Playlist :<a href="https://www.youtube.com/watch?v=ZyhVh-qRZPA&amp;list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS">https://www.youtube.com/watch?v=ZyhVh-qRZPA&amp;list=PL-osiE80TeTsWmV9i9c58mdDCSskIFdDS</a>
10 min  pandas : <a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html">https://pandas.pydata.org/pandas-docs/stable/user_guide/10min.html</a>
</p>
</div>
</div>

<div id="outline-container-org91c8df7" class="outline-2">
<h2 id="org91c8df7">Install pandas</h2>
<div class="outline-text-2" id="text-org91c8df7">
<p>
install pandas
</p>
<div class="org-src-container">
<pre class="src src-sh">pip install pandas
pip install jupyter notebook
pip install jupyterlab
</pre>
</div>

<p>
download data
stack Overflow Annual Developer Survey
</p>
</div>
</div>
<div id="outline-container-org0ea1bc5" class="outline-2">
<h2 id="org0ea1bc5">Import and Export</h2>
<div class="outline-text-2" id="text-org0ea1bc5">
<p>
<a href="./pandas-sub-doc/Import-Export.html">./pandas-sub-doc/Import-Export.html</a>
</p>
</div>
<div id="outline-container-orgca56cd0" class="outline-3">
<h3 id="orgca56cd0">Import</h3>
<div class="outline-text-3" id="text-orgca56cd0">
<div class="org-src-container">
<pre class="src src-python">import pandas as pd

df = pd.read_csv('data/survey_results_public.csv')
# Set index from the file 
df = pd.read_csv('data/survey_results_public.csv',index=dates)
df = pd.read_excel(open('tmp.xlsx', 'rb'),
	      sheet_name='Sheet3')
# if index is date or datetime you need to convert it datetime formate to sort or do datetime operations
df = pd.read_clipboard(sep=r"[ ]{2,}")  #https://stackoverflow.com/questions/61605415/how-can-we-resample-ohlcv-1-minute-pandas-dataframe-into-a-5-minute-dataframe
df = pf.read_html('https://simple.wikiepedia.org/wiki/List_of_U.S._states')
# TODO read from databsae : sqllite3, mysql,psql, mongodb
</pre>
</div>
<p>
For more information on read excel <a href="https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_excel.html#">link</a>
</p>
</div>
</div>
<div id="outline-container-org4c96a4b" class="outline-3">
<h3 id="org4c96a4b">Export</h3>
<div class="outline-text-3" id="text-org4c96a4b">
</div>
<div id="outline-container-org38ede06" class="outline-4">
<h4 id="org38ede06">Export to csv</h4>
</div>
<div id="outline-container-orgaa5fb08" class="outline-4">
<h4 id="orgaa5fb08">Export to excel</h4>
<div class="outline-text-4" id="text-orgaa5fb08">
<div class="org-src-container">
<pre class="src src-python">import openpyxl
file_rpath = '../database/option_trading-banknifty/HDFCBANK_historical_data'# os.path.splittext('/temp/test.txt'))
file_name = file_rpath+".xlsx"
# df.to_excel(file_name,sheet_name='1minute',,index=False) can't write other sheets in this file
# if we use =to_excel= to write next sheet then it will rewrite entire file and all the data will be lost 

with pd.ExcelWriter(file_name, mode="w",engine="openpyxl")as writer:
    df.to_excel(writer, sheet_name="1minute")
    df_temp =down_sample_by_minute(df,2)
    df_temp.to_excel(writer,sheet_name='2minute')
    df_temp =down_sample_by_minute(df,3)
    df_temp.to_excel(writer,sheet_name='3minute')
    df_temp =down_sample_by_minute(df,5)
    df_temp.to_excel(writer,sheet_name='5minute')
</pre>
</div>
</div>
</div>

<div id="outline-container-org51b61f8" class="outline-4">
<h4 id="org51b61f8">Export to html</h4>
</div>
<div id="outline-container-org277a2af" class="outline-4">
<h4 id="org277a2af">Export to markdown</h4>
<div class="outline-text-4" id="text-org277a2af">
<div class="org-src-container">
<pre class="src src-python">import numpy as np
from sklearn.datasets import load_iris
import pandas as pd

data = load_iris()
df = pd.DataFrame(data.data,
		  columns=data.feature_names)

# Converts the dataframe into str object with formatting
print(df.to_markdown())
</pre>
</div>
</div>
</div>

<div id="outline-container-org5b6432a" class="outline-4">
<h4 id="org5b6432a">Export to database sqllite3</h4>
<div class="outline-text-4" id="text-org5b6432a">
<div class="org-src-container">
<pre class="src src-python">from sqlalchemy import create_engine
import psycopg2

engine = create_engine('postgresql://dbuser:dbpass@localhost:5432/sample_db')

# To READ or IMPORT 
sql_df = pd.read_sql('sample_table', engine, index_col='Respondent')

# TO EXPORT or WRITE
india_df.to_sql('sample_table', engine, if_exists='replace')
</pre>
</div>


<p>
For sqlite
</p>

<p>
<a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#reading-tables">https://pandas.pydata.org/pandas-docs/stable/user_guide/io.html#reading-tables</a>
</p>

<p>
<a href="https://stackoverflow.com/questions/36028759/how-to-open-and-convert-sqlite-database-to-pandas-dataframe">https://stackoverflow.com/questions/36028759/how-to-open-and-convert-sqlite-database-to-pandas-dataframe</a>
</p>


<div class="org-src-container">
<pre class="src src-python">import sqlite3
import pandas as pd
# Create your connection.
cnx = sqlite3.connect('file.db')

df = pd.read_sql_query("SELECT * FROM table_name", cnx)
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a3ed99" class="outline-4">
<h4 id="org9a3ed99">Export to org-mode or psql formate</h4>
<div class="outline-text-4" id="text-org9a3ed99">
<div class="org-src-container">
<pre class="src src-python">from tabulate import tabulate
import pandas as pd

df = pd.DataFrame({'col_two' : [0.0001, 1e-005 , 1e-006, 1e-007],
		   'column_3' : ['ABCD', 'ABCD', 'long string', 'ABCD']})

print(tabulate(df, headers='keys', tablefmt='psql'))

# +----+-----------+-------------+

# |    |   col_two | column_3    |
# |----+-----------+-------------|
# |  0 |    0.0001 | ABCD        |
# |  1 |    1e-05  | ABCD        |
# |  2 |    1e-06  | long string |
