program/Notes_pandas.org
* View
#+begin_src python  
df #
display(df) # style  works only in jupyter not in terminal 
print(df) # plane text

df.tail(10)
df.head(10)
# To set the maximum rows and columns to view 
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

# to get the no.of rows and no.of columns 
df.shape  # (88883,85) # no.of rows:88883 , # no.of columns: 85
#+end_src
* Create dataframe
Types of creating dataframe
- using dictionary 
** Using dictionary each =key is column name=  =value is list_of elements in column= 
#+begin_src python 
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd

df = pd.DataFrame(people)
#+end_src

|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |
** Create Empty dataframe
#+begin_src python
data = pd.DataFrame(columns=['date', 'open', 'high', 'low', 'close', 'volume'])
print(data)
#Empty DataFrame
#Columns: [date, open, high, low, close, volume]
#Index: []

# display(data)
#+end_src

** TODO Create db with list of dictionary
#+begin_src python
my_list = [{'date': datetime.datetime(2022, 8, 1, 9, 15, tzinfo=tzoffset(None, 19800)),
        'open': 529.05, 'high': 529.95, 'low': 528.9, 'close': 529.8, 'volume': 99353},
    {'date': datetime.datetime(2022, 8, 1, 9, 16, tzinfo=tzoffset(None, 19800)),
        'open': 529.8, 'high': 530.35, 'low': 529.5, 'close': 529.8, 'volume': 50971},
    {'date': datetime.datetime(2022, 8, 1, 9, 17, tzinfo=tzoffset(None, 19800)),
        'open': 529.75, 'high': 530, 'low': 528.65, 'close': 528.65, 'volume': 76733},
    {'date': datetime.datetime(2022, 8, 1, 9, 18, tzinfo=tzoffset(None, 19800)),
        'open': 528.75, 'high': 528.75, 'low': 528, 'close': 528.35, 'volume': 50487},
    {'date': datetime.datetime(2022, 8, 1, 9, 19, tzinfo=tzoffset(None, 19800)),
        'open': 528.35, 'high': 528.4, 'low': 527.65, 'close': 527.9, 'volume': 45933},
    {'date': datetime.datetime(2022, 8, 1, 9, 20, tzinfo=tzoffset(None, 19800)),
        'open': 527.9, 'high': 527.9, 'low': 526.5, 'close': 526.5, 'volume': 61776},
    {'date': datetime.datetime(2022, 8, 1, 9, 21, tzinfo=tzoffset(None, 19800)),
        'open': 526.65, 'high': 527.05, 'low': 526.4, 'close': 526.9, 'volume': 52064},
    {'date': datetime.datetime(2022, 8, 1, 9, 22, tzinfo=tzoffset(None, 19800)),
        'open': 527, 'high': 527.8, 'low': 526.4, 'close': 527.8, 'volume': 44571},
    {'date': datetime.datetime(2022, 8, 1, 9, 23, tzinfo=tzoffset(None, 19800)),
        'open': 527.55, 'high': 527.9, 'low': 527.3, 'close': 527.65, 'volume': 29982},
    {'date': datetime.datetime(2022, 8, 1, 9, 24, tzinfo=tzoffset(None, 19800)),
        'open': 527.5, 'high': 528.4, 'low': 527.45, 'close': 528.25, 'volume': 51639},
    {'date': datetime.datetime(2022, 8, 1, 9, 25, tzinfo=tzoffset(None, 19800)), 
        'open': 528.3, 'high': 529.4, 'low': 528.3, 'close': 529.2, 'volume': 70639}, 
        {'date': datetime.datetime(2022, 8, 1, 9, 26, tzinfo=tzoffset(None, 19800)), 
        'open': 529.2, 'high': 529.2, 'low': 528.3, 'close': 528.55, 'volume': 46564}]

data = pd.DataFrame(my_list)
#+end_src

|    | date                |   open |   high |    low |   close |   volume |
|----+---------------------+--------+--------+--------+---------+----------|
|  0 | 2022-08-01 09:15:00 | 529.05 | 529.95 | 528.9  |  529.8  |    99353 |
|  1 | 2022-08-01 09:16:00 | 529.8  | 530.35 | 529.5  |  529.8  |    50971 |
|  2 | 2022-08-01 09:17:00 | 529.75 | 530    | 528.65 |  528.65 |    76733 |
|  3 | 2022-08-01 09:18:00 | 528.75 | 528.75 | 528    |  528.35 |    50487 |
|  4 | 2022-08-01 09:19:00 | 528.35 | 528.4  | 527.65 |  527.9  |    45933 |
|  5 | 2022-08-01 09:20:00 | 527.9  | 527.9  | 526.5  |  526.5  |    61776 |
|  6 | 2022-08-01 09:21:00 | 526.65 | 527.05 | 526.4  |  526.9  |    52064 |
|  7 | 2022-08-01 09:22:00 | 527    | 527.8  | 526.4  |  527.8  |    44571 |
|  8 | 2022-08-01 09:23:00 | 527.55 | 527.9  | 527.3  |  527.65 |    29982 |
|  9 | 2022-08-01 09:24:00 | 527.5  | 528.4  | 527.45 |  528.25 |    51639 |
| 10 | 2022-08-01 09:25:00 | 528.3  | 529.4  | 528.3  |  529.2  |    70639 |
| 11 | 2022-08-01 09:26:00 | 529.2  | 529.2  | 528.3  |  528.55 |    46564 |

** Create with json data or dictionary
** Create empty column
#+begin_src
data = yf.download("MSFT", period ='2d', interval="1m")    # Working from april 2020
del data['Close']
data.rename(columns={'Open': 'open','High':'high','Low':'low','Adj Close' : 'close','Volume':'volume'}, inplace=True)
data = data.tz_localize(None)

data=data.assign(gain="",loss='',rsi='',ma_fast='',ma_slow='',macd='')
print(data)
#+end_src
** Add Empty Colum to existing dataframe
#+begin_src python
df = pd.DataFrame({"A": [1,2,3], "B": [2,3,4]})
df
#Out[18]:
#   A  B
#0  1  2
#1  2  3
#2  3  4

df.assign(C="",D=np.nan)
#Out[21]:
#   A  B C   D
#0  1  2   NaN
#1  2  3   NaN
#2  3  4   NaN
#+end_src
