program/Notes_pandas.html
# |  3 |    1e-07  | ABCD        |

# +----+-----------+-------------+

</pre>
</div>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">1</th>
<th scope="col" class="org-right">col two</th>
<th scope="col" class="org-left">column 3</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-right">0.0001</td>
<td class="org-left">ABCD</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">1e-05</td>
<td class="org-left">ABCD</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">1e-06</td>
<td class="org-left">long string</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">1e-07</td>
<td class="org-left">ABCD</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="outline-container-org547b84a" class="outline-2">
<h2 id="org547b84a">View</h2>
<div class="outline-text-2" id="text-org547b84a">
<div class="org-src-container">
<pre class="src src-python">df #
display(df) # style  works only in jupyter not in terminal 
print(df) # plane text

df.tail(10)
df.head(10)
# To set the maximum rows and columns to view 
pd.set_option('display.max_columns', 85)
pd.set_option('display.max_rows', 85)

# to get the no.of rows and no.of columns 
df.shape  # (88883,85) # no.of rows:88883 , # no.of columns: 85
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb1e4cf" class="outline-2">
<h2 id="orgdb1e4cf">Create dataframe</h2>
<div class="outline-text-2" id="text-orgdb1e4cf">
<p>
Types of creating dataframe
</p>
<ul class="org-ul">
<li>using dictionary</li>
</ul>
</div>
<div id="outline-container-org7ee59d5" class="outline-3">
<h3 id="org7ee59d5">Using dictionary each <code>key is column name</code>  <code>value is list_of elements in column</code></h3>
<div class="outline-text-3" id="text-org7ee59d5">
<div class="org-src-container">
<pre class="src src-python">people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd

df = pd.DataFrame(people)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5fb6b32" class="outline-3">
<h3 id="org5fb6b32">Create Empty dataframe</h3>
<div class="outline-text-3" id="text-org5fb6b32">
<div class="org-src-container">
<pre class="src src-python">data = pd.DataFrame(columns=['date', 'open', 'high', 'low', 'close', 'volume'])
print(data)
#Empty DataFrame
#Columns: [date, open, high, low, close, volume]
#Index: []

# display(data)
</pre>
</div>
</div>
</div>

<div id="outline-container-org382dd3f" class="outline-3">
<h3 id="org382dd3f"><span class="todo TODO">TODO</span> Create db with list of dictionary</h3>
<div class="outline-text-3" id="text-org382dd3f">
<div class="org-src-container">
<pre class="src src-python">my_list = [{'date': datetime.datetime(2022, 8, 1, 9, 15, tzinfo=tzoffset(None, 19800)),
	'open': 529.05, 'high': 529.95, 'low': 528.9, 'close': 529.8, 'volume': 99353},
    {'date': datetime.datetime(2022, 8, 1, 9, 16, tzinfo=tzoffset(None, 19800)),
	'open': 529.8, 'high': 530.35, 'low': 529.5, 'close': 529.8, 'volume': 50971},
    {'date': datetime.datetime(2022, 8, 1, 9, 17, tzinfo=tzoffset(None, 19800)),
	'open': 529.75, 'high': 530, 'low': 528.65, 'close': 528.65, 'volume': 76733},
    {'date': datetime.datetime(2022, 8, 1, 9, 18, tzinfo=tzoffset(None, 19800)),
	'open': 528.75, 'high': 528.75, 'low': 528, 'close': 528.35, 'volume': 50487},
    {'date': datetime.datetime(2022, 8, 1, 9, 19, tzinfo=tzoffset(None, 19800)),
	'open': 528.35, 'high': 528.4, 'low': 527.65, 'close': 527.9, 'volume': 45933},
    {'date': datetime.datetime(2022, 8, 1, 9, 20, tzinfo=tzoffset(None, 19800)),
	'open': 527.9, 'high': 527.9, 'low': 526.5, 'close': 526.5, 'volume': 61776},
    {'date': datetime.datetime(2022, 8, 1, 9, 21, tzinfo=tzoffset(None, 19800)),
	'open': 526.65, 'high': 527.05, 'low': 526.4, 'close': 526.9, 'volume': 52064},
    {'date': datetime.datetime(2022, 8, 1, 9, 22, tzinfo=tzoffset(None, 19800)),
	'open': 527, 'high': 527.8, 'low': 526.4, 'close': 527.8, 'volume': 44571},
    {'date': datetime.datetime(2022, 8, 1, 9, 23, tzinfo=tzoffset(None, 19800)),
	'open': 527.55, 'high': 527.9, 'low': 527.3, 'close': 527.65, 'volume': 29982},
    {'date': datetime.datetime(2022, 8, 1, 9, 24, tzinfo=tzoffset(None, 19800)),
	'open': 527.5, 'high': 528.4, 'low': 527.45, 'close': 528.25, 'volume': 51639},
    {'date': datetime.datetime(2022, 8, 1, 9, 25, tzinfo=tzoffset(None, 19800)), 
	'open': 528.3, 'high': 529.4, 'low': 528.3, 'close': 529.2, 'volume': 70639}, 
	{'date': datetime.datetime(2022, 8, 1, 9, 26, tzinfo=tzoffset(None, 19800)), 
	'open': 529.2, 'high': 529.2, 'low': 528.3, 'close': 528.55, 'volume': 46564}]

data = pd.DataFrame(my_list)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">date</th>
<th scope="col" class="org-right">open</th>
<th scope="col" class="org-right">high</th>
<th scope="col" class="org-right">low</th>
<th scope="col" class="org-right">close</th>
<th scope="col" class="org-right">volume</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">2022-08-01 09:15:00</td>
<td class="org-right">529.05</td>
<td class="org-right">529.95</td>
<td class="org-right">528.9</td>
<td class="org-right">529.8</td>
<td class="org-right">99353</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">2022-08-01 09:16:00</td>
<td class="org-right">529.8</td>
<td class="org-right">530.35</td>
<td class="org-right">529.5</td>
<td class="org-right">529.8</td>
<td class="org-right">50971</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">2022-08-01 09:17:00</td>
<td class="org-right">529.75</td>
<td class="org-right">530</td>
<td class="org-right">528.65</td>
<td class="org-right">528.65</td>
<td class="org-right">76733</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">2022-08-01 09:18:00</td>
<td class="org-right">528.75</td>
<td class="org-right">528.75</td>
<td class="org-right">528</td>
<td class="org-right">528.35</td>
<td class="org-right">50487</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">2022-08-01 09:19:00</td>
<td class="org-right">528.35</td>
<td class="org-right">528.4</td>
<td class="org-right">527.65</td>
<td class="org-right">527.9</td>
<td class="org-right">45933</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">2022-08-01 09:20:00</td>
<td class="org-right">527.9</td>
<td class="org-right">527.9</td>
<td class="org-right">526.5</td>
<td class="org-right">526.5</td>
<td class="org-right">61776</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">2022-08-01 09:21:00</td>
<td class="org-right">526.65</td>
<td class="org-right">527.05</td>
<td class="org-right">526.4</td>
<td class="org-right">526.9</td>
<td class="org-right">52064</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">2022-08-01 09:22:00</td>
<td class="org-right">527</td>
<td class="org-right">527.8</td>
<td class="org-right">526.4</td>
<td class="org-right">527.8</td>
<td class="org-right">44571</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">2022-08-01 09:23:00</td>
<td class="org-right">527.55</td>
<td class="org-right">527.9</td>
<td class="org-right">527.3</td>
<td class="org-right">527.65</td>
<td class="org-right">29982</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">2022-08-01 09:24:00</td>
<td class="org-right">527.5</td>
<td class="org-right">528.4</td>
<td class="org-right">527.45</td>
<td class="org-right">528.25</td>
<td class="org-right">51639</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">2022-08-01 09:25:00</td>
<td class="org-right">528.3</td>
<td class="org-right">529.4</td>
<td class="org-right">528.3</td>
<td class="org-right">529.2</td>
<td class="org-right">70639</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">2022-08-01 09:26:00</td>
<td class="org-right">529.2</td>
<td class="org-right">529.2</td>
<td class="org-right">528.3</td>
<td class="org-right">528.55</td>
<td class="org-right">46564</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org053537a" class="outline-3">
<h3 id="org053537a">Create with json data or dictionary</h3>
</div>
<div id="outline-container-org25ce900" class="outline-3">
<h3 id="org25ce900">Create empty column</h3>
<div class="outline-text-3" id="text-org25ce900">
<pre class="example">
data = yf.download("MSFT", period ='2d', interval="1m")    # Working from april 2020
del data['Close']
data.rename(columns={'Open': 'open','High':'high','Low':'low','Adj Close' : 'close','Volume':'volume'}, inplace=True)
data = data.tz_localize(None)

data=data.assign(gain="",loss='',rsi='',ma_fast='',ma_slow='',macd='')
print(data)
</pre>
</div>
</div>
