program/Notes_pandas.org
* Header or Column Name or Field 
** Get all Header or Field or Columns Name
#+begin_src python
# Import pandas package
import pandas as pd
	
# making data frame
data = pd.read_csv("nba.csv")

# iterating the columns
for col in data.columns:
	print(col)
# Method 2 
print(list(data.columns)

# Method 3
print(data.keys())

# Method 4
print(list(data.columns.values))

# Method 5
print(list(data.columns.values.tolist()))
#+end_src

** rename  header or column name
#+begin_src python
df[['ConvertedComp','Hobbyist','Country']]
#+end_src

|   Respondent |    ConvertedComp | Hobbyist   | Country                                   |
|--------------+------------------+------------+-------------------------------------------|
|            1 |    nan           | Yes        | United Kingdom                            |
|            2 |    nan           | No         | Bosnia and Herzegovina                    |
|            3 |   8820           | Yes        | Thailand                                  |
|            4 |  61000           | No         | United States                             |
|            5 |    nan           | Yes        | Ukraine                                   |

#+begin_src python
df.rename(columns={'ConvertedComp': 'SalaryUSD'}, inplace=True)
df[['SalaryUSD','Hobbyist','Country']]
#+end_src

|   Respondent |    ConvertedComp | Hobbyist   | Country                                   |
|--------------+------------------+------------+-------------------------------------------|
|            1 |    nan           | Yes        | United Kingdom                            |
|            2 |    nan           | No         | Bosnia and Herzegovina                    |
|            3 |   8820           | Yes        | Thailand                                  |
|            4 |  61000           | No         | United States                             |
|            5 |    nan           | Yes        | Ukraine                                   |
** Add Empty Colum to existing dataframe
#+begin_src python
df = pd.DataFrame({"A": [1,2,3], "B": [2,3,4]})
df
#Out[18]:
#   A  B
#0  1  2
#1  2  3
#2  3  4

df.assign(C="",D=np.nan)
#Out[21]:
#   A  B C   D
#0  1  2   NaN
#1  2  3   NaN
#2  3  4   NaN
#+end_src
** Drop or delete Column
#+begin_src python
df = df.drop('column_name', axis=1)
df = df.drop(columns=['column_nameA', 'column_nameB'])

df.drop('column_name', axis=1, inplace=True)

df.drop(['column_nameA', 'column_nameB'], axis=1, inplace=True)

del df['column_name']
#+end_src
** Drop Row
#+begin_src python 
data.drop(["row_name1", "row_name2", "row_name3","row_name4"], inplace = True)
df = df.drop(df.index [ [ 0,2 ] ])

#+end_src
* getting data form dataframe

Get the specific column for dataframe 
#+begin_src python
df['email']
#+end_src

#+begin_src 
0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

#+end_src
or you can use as class elements to get the column
#+begin_src python
df.email
#+end_src

#+begin_src 
0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

#+end_src

Slice Column for dataframe 
#+begin_src python
df[['last', 'email']]
#+end_src

|   | last    | email                   |
|---+---------+-------------------------|
| 0 | Schafer | CoreyMSchafer@gmail.com |
| 1 | Doe     | JaneDoe@email.com       |
| 2 | Doe     | JohnDoe@email.com       |

Slice row form dataframe
#+begin_src python 
df[1:3]
#+end_src
|    | first   | last   | email             | employee id   |
|----+---------+--------+-------------------+---------------|
|  1 | Jane    | Doe    | JaneDoe@email.com | 2022B002      |
|  2 | John    | Doe    | JohnDoe@email.com | 2022B003      |

#+begin_src python
df.columns
#+end_src
#+begin_src 
Index(['first', 'last', 'email', 'employee id'], dtype='object')
#+end_src

To get the header list of dataframe
#+begin_src python 
list(df.columns.values)
#+end_src
** If index is datetime.date we can slice
=df['2022-01-01' :'2022-02-01']= we give you sliced dataframe from horizontal

You can get slice from loc and iloc also
