program/Notes_pandas.html
<div id="outline-container-org947b756" class="outline-3">
<h3 id="org947b756">Add Empty Colum to existing dataframe</h3>
<div class="outline-text-3" id="text-org947b756">
<div class="org-src-container">
<pre class="src src-python">df = pd.DataFrame({"A": [1,2,3], "B": [2,3,4]})
df
#Out[18]:
#   A  B
#0  1  2
#1  2  3
#2  3  4

df.assign(C="",D=np.nan)
#Out[21]:
#   A  B C   D
#0  1  2   NaN
#1  2  3   NaN
#2  3  4   NaN
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdd2eed7" class="outline-2">
<h2 id="orgdd2eed7">Header or Column Name or Field</h2>
<div class="outline-text-2" id="text-orgdd2eed7">
</div>
<div id="outline-container-orgbf0579d" class="outline-3">
<h3 id="orgbf0579d">Get all Header or Field or Columns Name</h3>
<div class="outline-text-3" id="text-orgbf0579d">
<div class="org-src-container">
<pre class="src src-python"># Import pandas package
import pandas as pd

# making data frame
data = pd.read_csv("nba.csv")

# iterating the columns
for col in data.columns:
	print(col)
# Method 2 
print(list(data.columns)

# Method 3
print(data.keys())

# Method 4
print(list(data.columns.values))

# Method 5
print(list(data.columns.values.tolist()))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc1eaf2a" class="outline-3">
<h3 id="orgc1eaf2a">rename  header or column name</h3>
<div class="outline-text-3" id="text-orgc1eaf2a">
<div class="org-src-container">
<pre class="src src-python">df[['ConvertedComp','Hobbyist','Country']]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Respondent</th>
<th scope="col" class="org-right">ConvertedComp</th>
<th scope="col" class="org-left">Hobbyist</th>
<th scope="col" class="org-left">Country</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">nan</td>
<td class="org-left">Yes</td>
<td class="org-left">United Kingdom</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">nan</td>
<td class="org-left">No</td>
<td class="org-left">Bosnia and Herzegovina</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">8820</td>
<td class="org-left">Yes</td>
<td class="org-left">Thailand</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">61000</td>
<td class="org-left">No</td>
<td class="org-left">United States</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">nan</td>
<td class="org-left">Yes</td>
<td class="org-left">Ukraine</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">df.rename(columns={'ConvertedComp': 'SalaryUSD'}, inplace=True)
df[['SalaryUSD','Hobbyist','Country']]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Respondent</th>
<th scope="col" class="org-right">ConvertedComp</th>
<th scope="col" class="org-left">Hobbyist</th>
<th scope="col" class="org-left">Country</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-right">nan</td>
<td class="org-left">Yes</td>
<td class="org-left">United Kingdom</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-right">nan</td>
<td class="org-left">No</td>
<td class="org-left">Bosnia and Herzegovina</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-right">8820</td>
<td class="org-left">Yes</td>
<td class="org-left">Thailand</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-right">61000</td>
<td class="org-left">No</td>
<td class="org-left">United States</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-right">nan</td>
<td class="org-left">Yes</td>
<td class="org-left">Ukraine</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5394316" class="outline-3">
<h3 id="org5394316">Add Empty Colum to existing dataframe</h3>
<div class="outline-text-3" id="text-org5394316">
<div class="org-src-container">
<pre class="src src-python">df = pd.DataFrame({"A": [1,2,3], "B": [2,3,4]})
df
#Out[18]:
#   A  B
#0  1  2
#1  2  3
#2  3  4

df.assign(C="",D=np.nan)
#Out[21]:
#   A  B C   D
#0  1  2   NaN
#1  2  3   NaN
#2  3  4   NaN
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdce4af0" class="outline-3">
<h3 id="orgdce4af0">Drop or delete Column</h3>
<div class="outline-text-3" id="text-orgdce4af0">
<div class="org-src-container">
<pre class="src src-python">df = df.drop('column_name', axis=1)
df = df.drop(columns=['column_nameA', 'column_nameB'])

df.drop('column_name', axis=1, inplace=True)

df.drop(['column_nameA', 'column_nameB'], axis=1, inplace=True)

del df['column_name']
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd80821a" class="outline-3">
<h3 id="orgd80821a">Drop Row</h3>
<div class="outline-text-3" id="text-orgd80821a">
<div class="org-src-container">
<pre class="src src-python">data.drop(["row_name1", "row_name2", "row_name3","row_name4"], inplace = True)
df = df.drop(df.index [ [ 0,2 ] ])

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc3f5b4e" class="outline-2">
<h2 id="orgc3f5b4e">getting data form dataframe</h2>
<div class="outline-text-2" id="text-orgc3f5b4e">
<p>
Get the specific column for dataframe 
</p>
<div class="org-src-container">
<pre class="src src-python">df['email']
</pre>
</div>

<pre class="example">
0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

</pre>
<p>
or you can use as class elements to get the column
</p>
<div class="org-src-container">
<pre class="src src-python">df.email
</pre>
</div>

<pre class="example">
0    CoreyMSchafer@gmail.com
1          JaneDoe@email.com
2          JohnDoe@email.com
Name: email, dtype: object

</pre>

<p>
Slice Column for dataframe 
</p>
<div class="org-src-container">
<pre class="src src-python">df[['last', 'email']]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>

<p>
Slice row form dataframe
</p>
<div class="org-src-container">
<pre class="src src-python">df[1:3]
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">df.columns
</pre>
</div>
<pre class="example">
Index(['first', 'last', 'email', 'employee id'], dtype='object')
</pre>

<p>
To get the header list of dataframe
</p>
<div class="org-src-container">
<pre class="src src-python">list(df.columns.values)
</pre>
</div>
</div>
<div id="outline-container-orgb4a7f64" class="outline-3">
<h3 id="orgb4a7f64">If index is datetime.date we can slice</h3>
<div class="outline-text-3" id="text-orgb4a7f64">
<p>
<code>df['2022-01-01' :'2022-02-01']</code> we give you sliced dataframe from horizontal
</p>

<p>
You can get slice from loc and iloc also
</p>
</div>
</div>
</div>
