program/Notes_pandas.org
* Set Index 
The index of pandas can be either a integer or float or string
we can set the index of the data frame like
#+begin_src python 
df.set_index("employee id")
#+end_src


|             | first | last    | email                   |
| employee id |       |         |                         |
|-------------+-------+---------+-------------------------|
| 2022B001    | Corey | Schafer | CoreyMSchafer@gmail.com |
| 2022B002    | Jane  | Doe     | JaneDoe@email.com       |
| 2022B003    | John  | Doe     | JohnDoe@email.com       |

We can reset the index by
#+begin_src python
df.reset_index(inplace=True)
#+end_src

|   | first | last    | email                   | employee id |
|---+-------+---------+-------------------------+-------------|
| 0 | Corey | Schafer | CoreyMSchafer@gmail.com | 2022B001    |
| 1 | Jane  | Doe     | JaneDoe@email.com       | 2022B002    |
| 2 | John  | Doe     | JohnDoe@email.com       | 2022B003    |
* unique element in row/column
To get the unique value in all column

#+begin_src python
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd
df = pd.DataFrame(people)
#+end_src


#+begin_src python
for col in df:
  print(df[col].unique())
#+end_src

#+begin_src 
['Corey' 'Jane' 'John']
['Schafer' 'Doe']
['CoreyMSchafer@gmail.com' 'JaneDoe@email.com' 'JohnDoe@email.com']
#+end_src


* Inplace
In general any operation performed in dataframe will not result in dataframe we need to assigne the change to the dataframe or

Pandas has inbuild function to save the change performed on dataframe
eg:
#+begin_src python
df.set_index("employee id") # no change in df
df = df.set_index("employee id") # df is updated
#or
df.set_index("employee id", inplace=True) # df is updated

#+end_src
* For loop in pandas
loop thorugh column
#+begin_src python
for (columnName, columnData) in inf_df.iteritems():
   print('Colunm Name : ', columnName)
   print('Column Contents : ', columnData.values)
#+end_src

column
#+begin_src python
for col in df:                                                                      
    alleles = list()                                                                
    for num, allele in enumerate(letterOrder):                                      
        alleles.append(df[col].str.count(allele).sum())                             

    full_results[col] = [letterOrder[np.argmax(alleles)], np.max(alleles)]
#+end_src

loop thouugh rows
#+begin_src python
for idx, row in df.iterrows():
    print(idx, row['Year'], row['Sales'])
# Returns:
# 0 2018 1000
# 1 2019 2300
# 2 2020 1900
# 3 2021 3400
#+end_src
* Selection
 data access methods, =.at=, =.iat=, =.loc= and =.iloc=.
** Lables (.loc)
We can access the row using =index value(loc)= or =index no(iloc)= \\
By default the index is =not set= then the =index value= will be row number starting with zero

If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.

This label can be used to access a specified value.

#+begin_src python
df.set_index("employee id",inplace=True)

df.loc['2022B003'] # Note need to set index
#+end_src

#+begin_src 
first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2022B003, dtype: object
#+end_src

#+begin_src python
df.loc['2022B002':'2022B003'] # Note need to set index
#+end_src

| employee id   | first   | last   | email             |
|---------------+---------+--------+-------------------|
| 2022B002      | Jane    | Doe    | JaneDoe@email.com |
| 2022B003      | John    | Doe    | JohnDoe@email.com |

Slice by row and column
#+begin_src python
df.loc['2022B002':'2022B003',['first','email']] # Note need to set index
#+end_src

| employee id   | first   | email             |
|---------------+---------+-------------------|
| 2022B002      | Jane    | JaneDoe@email.com |
| 2022B003      | John    | JohnDoe@email.com |

#+begin_src python
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}
df = pd.DataFrame(people)
print(f'df.index.name :{df.index.name}')
print(f'df.index.values:{df.index.values}') 

df.set_index("employee id",inplace=True)
print('after setting index as employee')
print(f'df.index.name :{df.index.name}')
print(f'df.index.values:{df.index.values}') 
display(df)


df.index[df["first"]=='Jane'].tolist()
#+end_src

result 
#+begin_quote
df.index.name :None \\
df.index.values:[0 1 2] \\
after setting index as employee \\
df.index.name :employee id \\
df.index.values:['2022B001' '2022B002' '2022B003']
#+end_quote
