program/Notes_pandas.html
<div id="outline-container-org1ab1503" class="outline-2">
<h2 id="org1ab1503">Set Index</h2>
<div class="outline-text-2" id="text-org1ab1503">
<p>
The index of pandas can be either a integer or float or string
we can set the index of the data frame like
</p>
<div class="org-src-container">
<pre class="src src-python">df.set_index("employee id")
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>

<tr>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-left">&#xa0;</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2022B001</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-left">2022B002</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-left">2022B003</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>

<p>
We can reset the index by
</p>
<div class="org-src-container">
<pre class="src src-python">df.reset_index(inplace=True)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgda64ecc" class="outline-2">
<h2 id="orgda64ecc">unique element in row/column</h2>
<div class="outline-text-2" id="text-orgda64ecc">
<p>
To get the unique value in all column
</p>

<div class="org-src-container">
<pre class="src src-python">people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd
df = pd.DataFrame(people)
</pre>
</div>


<div class="org-src-container">
<pre class="src src-python">for col in df:
  print(df[col].unique())
</pre>
</div>

<pre class="example">
['Corey' 'Jane' 'John']
['Schafer' 'Doe']
['CoreyMSchafer@gmail.com' 'JaneDoe@email.com' 'JohnDoe@email.com']
</pre>
</div>
</div>


<div id="outline-container-org093abe5" class="outline-2">
<h2 id="org093abe5">Inplace</h2>
<div class="outline-text-2" id="text-org093abe5">
<p>
In general any operation performed in dataframe will not result in dataframe we need to assigne the change to the dataframe or
</p>

<p>
Pandas has inbuild function to save the change performed on dataframe
eg:
</p>
<div class="org-src-container">
<pre class="src src-python">df.set_index("employee id") # no change in df
df = df.set_index("employee id") # df is updated
#or
df.set_index("employee id", inplace=True) # df is updated

</pre>
</div>
</div>
</div>
<div id="outline-container-orgdadc893" class="outline-2">
<h2 id="orgdadc893">For loop in pandas</h2>
<div class="outline-text-2" id="text-orgdadc893">
<p>
loop thorugh column
</p>
<div class="org-src-container">
<pre class="src src-python">for (columnName, columnData) in inf_df.iteritems():
   print('Colunm Name : ', columnName)
   print('Column Contents : ', columnData.values)
</pre>
</div>

<p>
column
</p>
<div class="org-src-container">
<pre class="src src-python">for col in df:                                                                      
    alleles = list()                                                                
    for num, allele in enumerate(letterOrder):                                      
	alleles.append(df[col].str.count(allele).sum())                             

    full_results[col] = [letterOrder[np.argmax(alleles)], np.max(alleles)]
</pre>
</div>

<p>
loop thouugh rows
</p>
<div class="org-src-container">
<pre class="src src-python">for idx, row in df.iterrows():
    print(idx, row['Year'], row['Sales'])
# Returns:
# 0 2018 1000
# 1 2019 2300
# 2 2020 1900
# 3 2021 3400
</pre>
</div>
</div>
</div>
<div id="outline-container-org2fd7005" class="outline-2">
<h2 id="org2fd7005">Selection</h2>
<div class="outline-text-2" id="text-org2fd7005">
<p>
data access methods, <code>.at</code>, <code>.iat</code>, <code>.loc</code> and <code>.iloc</code>.
</p>
</div>
<div id="outline-container-orga809d89" class="outline-3">
<h3 id="orga809d89">Lables (.loc)</h3>
<div class="outline-text-3" id="text-orga809d89">
<p>
We can access the row using <code>index value(loc)</code> or <code>index no(iloc)</code> <br />
By default the index is <code>not set</code> then the <code>index value</code> will be row number starting with zero
</p>

<p>
If nothing else is specified, the values are labeled with their index number. First value has index 0, second value has index 1 etc.
</p>

<p>
This label can be used to access a specified value.
</p>

<div class="org-src-container">
<pre class="src src-python">df.set_index("employee id",inplace=True)

df.loc['2022B003'] # Note need to set index
</pre>
</div>

<pre class="example">
first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2022B003, dtype: object
</pre>

<div class="org-src-container">
<pre class="src src-python">df.loc['2022B002':'2022B003'] # Note need to set index
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2022B002</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-left">2022B003</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>

<p>
Slice by row and column
</p>
<div class="org-src-container">
<pre class="src src-python">df.loc['2022B002':'2022B003',['first','email']] # Note need to set index
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">2022B002</td>
<td class="org-left">Jane</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-left">2022B003</td>
<td class="org-left">John</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}
df = pd.DataFrame(people)
print(f'df.index.name :{df.index.name}')
print(f'df.index.values:{df.index.values}') 

df.set_index("employee id",inplace=True)
print('after setting index as employee')
print(f'df.index.name :{df.index.name}')
print(f'df.index.values:{df.index.values}') 
display(df)


df.index[df["first"]=='Jane'].tolist()
</pre>
</div>

<p>
result 
</p>
<blockquote>
<p>
df.index.name :None <br />
df.index.values:[0 1 2] <br />
after setting index as employee <br />
df.index.name :employee id <br />
df.index.values:['2022B001' '2022B002' '2022B003']
</p>
</blockquote>
</div>
</div>
