program/Notes_pandas.org
** iloc
iloc is simillar to loc insted of index value we will use index number
#+begin_src python
df.set_index("employee id",inplace=True)
df.iloc[2] # Note need to set index
#+end_src

#+begin_src 
first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2022B003, dtype: object
#+end_src

#+begin_src python
df.iloc[1:3] # Note need to set index
#+end_src


|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |

Slice by row and column in iloc 
#+begin_src python
df.iloc[[1,2],[0,2]]
#+end_src
|    | first   | email             |
|----+---------+-------------------|
|  1 | Jane    | JaneDoe@email.com |
|  2 | John    | JohnDoe@email.com |
** set value using iloc
#+begin_src python
idx = start_idx # 388
# for idx in range(data.shape[0]):
diff = data.iloc[idx]['close'] - data.iloc[idx-1]['close']
if diff >=0:
    data.iloc[idx,data.columns.get_loc("gain")] = diff
    data.iloc[idx,data.columns.get_loc('loss')] = 0

else:
    data.iloc[idx,data.columns.get_loc("gain")] = 0
    data.iloc[idx,data.columns.get_loc('loss')] = -1*diff
#+end_src
** at
** iat
** loc to  iloc and iloc to loc

#+begin_src python 
df.iloc[0].name # give loc Timestamp('2020-01-01 09:15:00')
named_index = df.iloc[0].name
df.index.get_loc(named_index)  # gives iloc value 
#+end_src

#+begin_src 
df.index.get_loc(window_stop_row.name)
#+end_src

#+begin_src python
#In [131]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

#Out[131]:
#                   A         B         C         D
#2000-01-01  0.095234 -1.000863  0.899732 -1.742152
#2000-01-02 -0.517544 -1.274137  1.734024 -1.369487
#2000-01-03  0.134112  1.964386 -0.120282  0.573676
#2000-01-04 -0.737499 -0.581444  0.528500 -0.737697
#2000-01-05 -1.777800  0.795093  0.120681  0.524045
#2000-01-06 -0.048432 -0.751365 -0.760417 -0.181658
#2000-01-07 -0.570800  0.248608 -1.428998 -0.662014
#2000-01-08 -0.147326  0.717392  3.138620  1.208639

#In [133]:    
window_stop_row = df[df.index < '2000-01-04'].iloc[-1]
window_stop_row.name

#Out[133]:
#Timestamp('2000-01-03 00:00:00', offset='D')

#In [134]:
df.index.get_loc(window_stop_row.name)

#Out[134]:
#2  # iloc value 
#+end_src
