program/Notes_pandas.html
<div id="outline-container-orgd36adcc" class="outline-3">
<h3 id="orgd36adcc">iloc</h3>
<div class="outline-text-3" id="text-orgd36adcc">
<p>
iloc is simillar to loc insted of index value we will use index number
</p>
<div class="org-src-container">
<pre class="src src-python">df.set_index("employee id",inplace=True)
df.iloc[2] # Note need to set index
</pre>
</div>

<pre class="example">
first                 John
last                   Doe
email    JohnDoe@email.com
Name: 2022B003, dtype: object
</pre>

<div class="org-src-container">
<pre class="src src-python">df.iloc[1:3] # Note need to set index
</pre>
</div>


<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>

<p>
Slice by row and column in iloc 
</p>
<div class="org-src-container">
<pre class="src src-python">df.iloc[[1,2],[0,2]]
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-org5808277" class="outline-3">
<h3 id="org5808277">set value using iloc</h3>
<div class="outline-text-3" id="text-org5808277">
<div class="org-src-container">
<pre class="src src-python">idx = start_idx # 388
# for idx in range(data.shape[0]):
diff = data.iloc[idx]['close'] - data.iloc[idx-1]['close']
if diff &gt;=0:
    data.iloc[idx,data.columns.get_loc("gain")] = diff
    data.iloc[idx,data.columns.get_loc('loss')] = 0

else:
    data.iloc[idx,data.columns.get_loc("gain")] = 0
    data.iloc[idx,data.columns.get_loc('loss')] = -1*diff
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb9f2e69" class="outline-3">
<h3 id="orgb9f2e69">at</h3>
</div>
<div id="outline-container-org01ea127" class="outline-3">
<h3 id="org01ea127">iat</h3>
</div>
<div id="outline-container-org89a6adb" class="outline-3">
<h3 id="org89a6adb">loc to  iloc and iloc to loc</h3>
<div class="outline-text-3" id="text-org89a6adb">
<div class="org-src-container">
<pre class="src src-python">df.iloc[0].name # give loc Timestamp('2020-01-01 09:15:00')
named_index = df.iloc[0].name
df.index.get_loc(named_index)  # gives iloc value 
</pre>
</div>

<pre class="example">
df.index.get_loc(window_stop_row.name)
</pre>

<div class="org-src-container">
<pre class="src src-python">#In [131]:
dates = pd.date_range('1/1/2000', periods=8)
df = pd.DataFrame(np.random.randn(8, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

#Out[131]:
#                   A         B         C         D
#2000-01-01  0.095234 -1.000863  0.899732 -1.742152
#2000-01-02 -0.517544 -1.274137  1.734024 -1.369487
#2000-01-03  0.134112  1.964386 -0.120282  0.573676
#2000-01-04 -0.737499 -0.581444  0.528500 -0.737697
#2000-01-05 -1.777800  0.795093  0.120681  0.524045
#2000-01-06 -0.048432 -0.751365 -0.760417 -0.181658
#2000-01-07 -0.570800  0.248608 -1.428998 -0.662014
#2000-01-08 -0.147326  0.717392  3.138620  1.208639

#In [133]:    
window_stop_row = df[df.index &lt; '2000-01-04'].iloc[-1]
window_stop_row.name

#Out[133]:
#Timestamp('2000-01-03 00:00:00', offset='D')

#In [134]:
df.index.get_loc(window_stop_row.name)

#Out[134]:
#2  # iloc value 
</pre>
</div>
</div>
</div>
</div>
