program/Notes_pandas.org
* Filters
https://datatofish.com/filter-pandas-dataframe/
https://www.statology.org/pandas-filter-by-index-value/

#+begin_src python
# '|': or comparisoin operator 
# '&' : and  comparison operator 
# '~' : not operator

filt = (df['last'] == 'Schafer') | (df['first'] == 'John')
filt
# Result 
# 0     True
# 1    False
# 2     True
# dtype: bool
df[filt]
#+end_src
|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |

#+begin_src python
df[~filt] # select which is not filtered
#+end_src
|    | first   | last   | email             | employee id   |
|----+---------+--------+-------------------+---------------|
|  1 | Jane    | Doe    | JaneDoe@email.com | 2022B002      |


Filter column 'LanguageWorkedWith' where it shouldn't have any =NaN= value
#+begin_src python
print(df['LanguageWorkedWith'])
#+end_src

#+begin_src 
Respondent
1                          HTML/CSS;Java;JavaScript;Python
2                                      C++;HTML/CSS;Python
3                                                 HTML/CSS
4                                      C;C++;C#;Python;SQL
5              C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
                               ...                        
88377                        HTML/CSS;JavaScript;Other(s):
88601                                                  NaN
88802                                                  NaN
88816                                                  NaN
88863    Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...
Name: LanguageWorkedWith, Length: 88883, dtype: object
#+end_src

#+begin_src python
filt
#+end_src

#+begin_src 
Respondent
1         True
2         True
3        False
4         True
5         True
         ...  
88377    False
88601    False
88802    False
88816    False
88863    False
Name: LanguageWorkedWith, Length: 88883, dtype: bool
#+end_src

#+begin_src python
df.loc[filt]
#+end_src
#+begin_src 
Respondent                                                   ...                                                   
1           I am a student who is learning to code      Yes  ...  Appropriate in length  Neither easy nor difficult
2           I am a student who is learning to code       No  ...  Appropriate in length  Neither easy nor difficult
4                   I am a developer by profession       No  ...  Appropriate in length                        Easy
5                   I am a developer by profession      Yes  ...  Appropriate in length                        Easy
8                      I code primarily as a hobby      Yes  ...  Appropriate in length  Neither easy nor difficult
...                                            ...      ...  ...                    ...                         ...
84539                                          NaN      Yes  ...  Appropriate in length                        Easy
85738                                          NaN      Yes  ...              Too short                        Easy
86566                                          NaN      Yes  ...  Appropriate in length                        Easy
87739                                          NaN      Yes  ...  Appropriate in length                        Easy
88212                                          NaN       No  ...  Appropriate in length                        Easy

[36443 rows x 84 columns]

#+end_src

#+begin_src python
df.loc[filt, 'LanguageWorkedWith']
#+end_src

#+begin_src 
Respondent
1                          HTML/CSS;Java;JavaScript;Python
2                                      C++;HTML/CSS;Python
4                                      C;C++;C#;Python;SQL
5              C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
8        Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
                               ...                        
84539    Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
85738      Bash/Shell/PowerShell;C++;Python;Ruby;Other(s):
86566      Bash/Shell/PowerShell;HTML/CSS;Python;Other(s):
87739             C;C++;HTML/CSS;JavaScript;PHP;Python;SQL
88212                           HTML/CSS;JavaScript;Python
Name: LanguageWorkedWith, Length: 36443, dtype: object
#+end_src
** filter get named index 
#+begin_src 
filter1 = (edf['breakout']==True)
# edf[(edf['breakout']==True)]
# display(filter1)
print(filter1.index)
print(filter1.index.values)
#+end_src

result 
#+begin_src 
DatetimeIndex(['2022-08-01 09:15:00', '2022-08-01 09:17:00',
               '2022-08-01 09:19:00', '2022-08-01 09:21:00',
               '2022-08-01 09:23:00', '2022-08-01 09:25:00',
               '2022-08-01 09:27:00', '2022-08-01 09:29:00',
               '2022-08-01 09:31:00', '2022-08-01 09:33:00',
               ...
               '2022-08-30 15:11:00', '2022-08-30 15:13:00',
               '2022-08-30 15:15:00', '2022-08-30 15:17:00',
               '2022-08-30 15:19:00', '2022-08-30 15:21:00',
               '2022-08-30 15:23:00', '2022-08-30 15:25:00',
               '2022-08-30 15:27:00', '2022-09-01 09:15:00'],
              dtype='datetime64[ns]', name='date', length=3741, freq=None)

['2022-08-01T09:15:00.000000000' '2022-08-01T09:17:00.000000000'
 '2022-08-01T09:19:00.000000000' ... '2022-08-30T15:25:00.000000000'
 '2022-08-30T15:27:00.000000000' '2022-09-01T09:15:00.000000000']

#+end_src

* Update element in dataframe
** Update element in data fram
#+begin_src python
people = {
     "first": ["Corey", 'Jane', 'John'], 
     "last": ["Schafer", 'Doe', 'Doe'], 
     "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
     "employee id": ["2022B001","2022B002","2022B003"]
}

df = pd.DataFrame(people)
#+end_src



 |    | first   | last    | email                   | employee id   |
 |----+---------+---------+-------------------------+---------------|
 |  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
 |  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
 |  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |

