program/Notes_pandas.html
<div id="outline-container-orgd49cb96" class="outline-2">
<h2 id="orgd49cb96">Filters</h2>
<div class="outline-text-2" id="text-orgd49cb96">
<p>
<a href="https://datatofish.com/filter-pandas-dataframe/">https://datatofish.com/filter-pandas-dataframe/</a>
<a href="https://www.statology.org/pandas-filter-by-index-value/">https://www.statology.org/pandas-filter-by-index-value/</a>
</p>

<div class="org-src-container">
<pre class="src src-python"># '|': or comparisoin operator 
# '&amp;' : and  comparison operator 
# '~' : not operator

filt = (df['last'] == 'Schafer') | (df['first'] == 'John')
filt
# Result 
# 0     True
# 1    False
# 2     True
# dtype: bool
df[filt]
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">df[~filt] # select which is not filtered
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>
</tbody>
</table>


<p>
Filter column 'LanguageWorkedWith' where it shouldn't have any <code>NaN</code> value
</p>
<div class="org-src-container">
<pre class="src src-python">print(df['LanguageWorkedWith'])
</pre>
</div>

<pre class="example">
Respondent
1                          HTML/CSS;Java;JavaScript;Python
2                                      C++;HTML/CSS;Python
3                                                 HTML/CSS
4                                      C;C++;C#;Python;SQL
5              C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
			       ...                        
88377                        HTML/CSS;JavaScript;Other(s):
88601                                                  NaN
88802                                                  NaN
88816                                                  NaN
88863    Bash/Shell/PowerShell;HTML/CSS;Java;JavaScript...
Name: LanguageWorkedWith, Length: 88883, dtype: object
</pre>

<div class="org-src-container">
<pre class="src src-python">filt
</pre>
</div>

<pre class="example">
Respondent
1         True
2         True
3        False
4         True
5         True
	 ...  
88377    False
88601    False
88802    False
88816    False
88863    False
Name: LanguageWorkedWith, Length: 88883, dtype: bool
</pre>

<div class="org-src-container">
<pre class="src src-python">df.loc[filt]
</pre>
</div>
<pre class="example">
Respondent                                                   ...                                                   
1           I am a student who is learning to code      Yes  ...  Appropriate in length  Neither easy nor difficult
2           I am a student who is learning to code       No  ...  Appropriate in length  Neither easy nor difficult
4                   I am a developer by profession       No  ...  Appropriate in length                        Easy
5                   I am a developer by profession      Yes  ...  Appropriate in length                        Easy
8                      I code primarily as a hobby      Yes  ...  Appropriate in length  Neither easy nor difficult
...                                            ...      ...  ...                    ...                         ...
84539                                          NaN      Yes  ...  Appropriate in length                        Easy
85738                                          NaN      Yes  ...              Too short                        Easy
86566                                          NaN      Yes  ...  Appropriate in length                        Easy
87739                                          NaN      Yes  ...  Appropriate in length                        Easy
88212                                          NaN       No  ...  Appropriate in length                        Easy

[36443 rows x 84 columns]

</pre>

<div class="org-src-container">
<pre class="src src-python">df.loc[filt, 'LanguageWorkedWith']
</pre>
</div>

<pre class="example">
Respondent
1                          HTML/CSS;Java;JavaScript;Python
2                                      C++;HTML/CSS;Python
4                                      C;C++;C#;Python;SQL
5              C++;HTML/CSS;Java;JavaScript;Python;SQL;VBA
8        Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
			       ...                        
84539    Bash/Shell/PowerShell;C;C++;HTML/CSS;Java;Java...
85738      Bash/Shell/PowerShell;C++;Python;Ruby;Other(s):
86566      Bash/Shell/PowerShell;HTML/CSS;Python;Other(s):
87739             C;C++;HTML/CSS;JavaScript;PHP;Python;SQL
88212                           HTML/CSS;JavaScript;Python
Name: LanguageWorkedWith, Length: 36443, dtype: object
</pre>
</div>
<div id="outline-container-org864b436" class="outline-3">
<h3 id="org864b436">filter get named index</h3>
<div class="outline-text-3" id="text-org864b436">
<pre class="example">
filter1 = (edf['breakout']==True)
# edf[(edf['breakout']==True)]
# display(filter1)
print(filter1.index)
print(filter1.index.values)
</pre>

<p>
result 
</p>
<pre class="example">
DatetimeIndex(['2022-08-01 09:15:00', '2022-08-01 09:17:00',
	       '2022-08-01 09:19:00', '2022-08-01 09:21:00',
	       '2022-08-01 09:23:00', '2022-08-01 09:25:00',
	       '2022-08-01 09:27:00', '2022-08-01 09:29:00',
	       '2022-08-01 09:31:00', '2022-08-01 09:33:00',
	       ...
	       '2022-08-30 15:11:00', '2022-08-30 15:13:00',
	       '2022-08-30 15:15:00', '2022-08-30 15:17:00',
	       '2022-08-30 15:19:00', '2022-08-30 15:21:00',
	       '2022-08-30 15:23:00', '2022-08-30 15:25:00',
	       '2022-08-30 15:27:00', '2022-09-01 09:15:00'],
	      dtype='datetime64[ns]', name='date', length=3741, freq=None)

['2022-08-01T09:15:00.000000000' '2022-08-01T09:17:00.000000000'
 '2022-08-01T09:19:00.000000000' ... '2022-08-30T15:25:00.000000000'
 '2022-08-30T15:27:00.000000000' '2022-09-01T09:15:00.000000000']

</pre>
</div>
</div>
</div>

<div id="outline-container-orgad7f0fd" class="outline-2">
<h2 id="orgad7f0fd">Update element in dataframe</h2>
<div class="outline-text-2" id="text-orgad7f0fd">
</div>
