program/Notes_pandas.org
*** Using loc
#+begin_src python 
df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
#+end_src
 |   | first | last    | email                   | employee id |
 |---+-------+---------+-------------------------+-------------|
 | 0 | Corey | Schafer | CoreyMSchafer@gmail.com | 2022B001    |
 | 1 | Jane  | Doe     | JaneDoe@email.com       | 2022B002    |
 | 2 | John  | Smith   | JohnSmith@email.com     | 2022B003    |
#+begin_src python
df[filt]['last'] = 'Smith' #Error: Can't copy SettingWithCopyWarning
df.loc[2, 'last'] = 'Smith'
#+end_src
*** Using at
simillar to loc 
#+begin_src python
df.loc[2, 'last'] = 'Smith'
df.at[2, 'last'] = 'Doe'
#+end_src
*** Using fuctions 
#+begin_src python 
df['email'].str.upper()
#+end_src

#+begin_src
0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object
#+end_src
#+begin_src python 
df['email'].apply(len)
#+end_src
#+begin_src 
0    23
1    17
2    17
Name: email, dtype: int64
#+end_src


#+begin_src python
def update_email(email):
    return email.capitalize()
df['email'].apply(update_email)
#+end_src

#+begin_src 
0    Coreymschafer@gmail.com
1          Janedoe@email.com
2          Johndoe@email.com
Name: email, dtype: object
#+end_src

*** Using lambda
#+begin_src python
df['email'].apply(lambda x: x.upper())
#+end_src

#+begin_src 
0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object
#+end_src
*** Using list compression
#+begin_src python
df.columns = [x.upper() for x in df.columns]
#+end_src

 |   | FIRST | LAST    | EMAIL                   | EMPLOYEE ID |
 |---+-------+---------+-------------------------+-------------|
 | 0 | Corey | Schafer | CoreyMSchafer@gmail.com | 2022B001    |
 | 1 | Jane  | Doe     | JaneDoe@email.com       | 2022B002    |
 | 2 | John  | Smith   | JohnSmith@email.com     | 2022B003    |

*** Using pandas 'apply'
#+begin_src python 
df['email'].apply(len)
#+end_src

#+begin_src 
0    23
1    17
2    17
Name: email, dtype: int64
#+end_src

#+begin_src python
df.apply(len, axis='columns')
#+end_src
#+begin_src 
0    3
1    3
2    3
dtype: int64
#+end_src

#+begin_src python
df.apply(pd.Series.min)
#first                      Corey
#last                         Doe
#email    coreymschafer@gmail.com
#dtype: object
#+end_src

#+begin_src python
df.apply(lambda x: x.min())
#first                      Corey
#last                         Doe
#email    coreymschafer@gmail.com
#dtype: object
#+end_src
*** Using pandas 'applymap''
#+begin_src python
df.applymap(len)
# 	first 	last 	email
#0 	5 	7 	23
#1 	4 	3 	17
#2 	4 	5 	17
df.applymap(str.lower)
# 	first 	last 	email
#0 	corey 	schafer 	coreymschafer@gmail.com
#1 	jane 	doe 	janedoe@email.com
#2 	john 	smith 	johndoe@email.com
#+end_src
*** Using pandas 'map'
#+begin_src python
df['Hobbyist']
#+end_src

#+begin_src 
Respondent
1        Yes
2         No
3        Yes
4         No
5        Yes
        ... 
88377    Yes
88601     No
88802     No
88816     No
88863    Yes
Name: Hobbyist, Length: 88883, dtype: object
#+end_src

#+begin_src python
df['Hobbyist'].map({'Yes': True, 'No': False})
df['Hobbyist'] = df['Hobbyist'].map({'Yes': True, 'No': False})
df['Hobbyist']
#+end_src

#+begin_src 
Respondent
1         True
2        False
3         True
4        False
5         True
         ...  
88377     True
88601    False
88802    False
88816    False
88863     True
Name: Hobbyist, Length: 88883, dtype: bool
#+end_src
*** Error in map if some elements in column is not specific
#+begin_src python
df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})
#0    Chris
#1     Mary
#2      NaN
#Name: first, dtype: object
df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
#0    Chris
#1     Mary
#2     Smit
#Name: first, dtype: object
#+end_src
* Add and remove rows and columns
#+begin_src python 
people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd

df = pd.DataFrame(people)
#+end_src

|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |
