program/Notes_pandas.html
<div id="outline-container-org91f0223" class="outline-3">
<h3 id="org91f0223">Update element in data fram</h3>
<div class="outline-text-3" id="text-org91f0223">
<div class="org-src-container">
<pre class="src src-python">people = {
     "first": ["Corey", 'Jane', 'John'], 
     "last": ["Schafer", 'Doe', 'Doe'], 
     "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
     "employee id": ["2022B001","2022B002","2022B003"]
}

df = pd.DataFrame(people)
</pre>
</div>



<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-org4157bc9" class="outline-4">
<h4 id="org4157bc9">Using loc</h4>
<div class="outline-text-4" id="text-org4157bc9">
<div class="org-src-container">
<pre class="src src-python">df.loc[2] = ['John', 'Smith', 'JohnSmith@email.com']
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Smith</td>
<td class="org-left">JohnSmith@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python">df[filt]['last'] = 'Smith' #Error: Can't copy SettingWithCopyWarning
df.loc[2, 'last'] = 'Smith'
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf3a5618" class="outline-4">
<h4 id="orgf3a5618">Using at</h4>
<div class="outline-text-4" id="text-orgf3a5618">
<p>
simillar to loc 
</p>
<div class="org-src-container">
<pre class="src src-python">df.loc[2, 'last'] = 'Smith'
df.at[2, 'last'] = 'Doe'
</pre>
</div>
</div>
</div>
<div id="outline-container-org80f31d1" class="outline-4">
<h4 id="org80f31d1">Using fuctions</h4>
<div class="outline-text-4" id="text-org80f31d1">
<div class="org-src-container">
<pre class="src src-python">df['email'].str.upper()
</pre>
</div>

<pre class="example">
0    COREYMSCHAFER@GMAIL.COM
1          JANEDOE@EMAIL.COM
2          JOHNDOE@EMAIL.COM
Name: email, dtype: object
</pre>
<div class="org-src-container">
<pre class="src src-python">df['email'].apply(len)
</pre>
</div>
<pre class="example">
0    23
1    17
2    17
Name: email, dtype: int64
</pre>


<div class="org-src-container">
<pre class="src src-python">def update_email(email):
    return email.capitalize()
df['email'].apply(update_email)
</pre>
</div>

<pre class="example">
0    Coreymschafer@gmail.com
1          Janedoe@email.com
2          Johndoe@email.com
Name: email, dtype: object
</pre>
</div>
</div>

<div id="outline-container-orgf59af81" class="outline-4">
<h4 id="orgf59af81">Using lambda</h4>
<div class="outline-text-4" id="text-orgf59af81">
<div class="org-src-container">
<pre class="src src-python">df['email'].apply(lambda x: x.upper())
</pre>
</div>

<pre class="example">
0    coreymschafer@gmail.com
1          janedoe@email.com
2          johndoe@email.com
Name: email, dtype: object
</pre>
</div>
</div>
<div id="outline-container-org63045b5" class="outline-4">
<h4 id="org63045b5">Using list compression</h4>
<div class="outline-text-4" id="text-org63045b5">
<div class="org-src-container">
<pre class="src src-python">df.columns = [x.upper() for x in df.columns]
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">FIRST</th>
<th scope="col" class="org-left">LAST</th>
<th scope="col" class="org-left">EMAIL</th>
<th scope="col" class="org-left">EMPLOYEE ID</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Smith</td>
<td class="org-left">JohnSmith@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org8aac319" class="outline-4">
<h4 id="org8aac319">Using pandas 'apply'</h4>
<div class="outline-text-4" id="text-org8aac319">
<div class="org-src-container">
<pre class="src src-python">df['email'].apply(len)
</pre>
</div>

<pre class="example">
0    23
1    17
2    17
Name: email, dtype: int64
</pre>

<div class="org-src-container">
<pre class="src src-python">df.apply(len, axis='columns')
</pre>
</div>
<pre class="example">
0    3
1    3
2    3
dtype: int64
</pre>

<div class="org-src-container">
<pre class="src src-python">df.apply(pd.Series.min)
#first                      Corey
#last                         Doe
#email    coreymschafer@gmail.com
#dtype: object
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">df.apply(lambda x: x.min())
#first                      Corey
#last                         Doe
#email    coreymschafer@gmail.com
#dtype: object
</pre>
</div>
</div>
</div>
<div id="outline-container-org2504670" class="outline-4">
<h4 id="org2504670">Using pandas 'applymap''</h4>
<div class="outline-text-4" id="text-org2504670">
<div class="org-src-container">
<pre class="src src-python">df.applymap(len)
# 	first 	last 	email
#0 	5 	7 	23
#1 	4 	3 	17
#2 	4 	5 	17
df.applymap(str.lower)
# 	first 	last 	email
#0 	corey 	schafer 	coreymschafer@gmail.com
#1 	jane 	doe 	janedoe@email.com
#2 	john 	smith 	johndoe@email.com
</pre>
</div>
</div>
</div>
<div id="outline-container-org0158c73" class="outline-4">
<h4 id="org0158c73">Using pandas 'map'</h4>
<div class="outline-text-4" id="text-org0158c73">
<div class="org-src-container">
<pre class="src src-python">df['Hobbyist']
</pre>
</div>

<pre class="example">
Respondent
1        Yes
2         No
3        Yes
4         No
5        Yes
	... 
88377    Yes
88601     No
88802     No
88816     No
88863    Yes
Name: Hobbyist, Length: 88883, dtype: object
</pre>

<div class="org-src-container">
<pre class="src src-python">df['Hobbyist'].map({'Yes': True, 'No': False})
df['Hobbyist'] = df['Hobbyist'].map({'Yes': True, 'No': False})
df['Hobbyist']
</pre>
</div>

<pre class="example">
Respondent
1         True
2        False
3         True
4        False
5         True
	 ...  
88377     True
88601    False
88802    False
88816    False
88863     True
Name: Hobbyist, Length: 88883, dtype: bool
</pre>
</div>
</div>
<div id="outline-container-org65ae1eb" class="outline-4">
<h4 id="org65ae1eb">Error in map if some elements in column is not specific</h4>
<div class="outline-text-4" id="text-org65ae1eb">
<div class="org-src-container">
<pre class="src src-python">df['first'].map({'Corey': 'Chris', 'Jane': 'Mary'})
#0    Chris
#1     Mary
#2      NaN
#Name: first, dtype: object
df['first'].replace({'Corey': 'Chris', 'Jane': 'Mary'})
#0    Chris
#1     Mary
#2     Smit
#Name: first, dtype: object
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb09e74a" class="outline-2">
<h2 id="orgb09e74a">Add and remove rows and columns</h2>
<div class="outline-text-2" id="text-orgb09e74a">
<div class="org-src-container">
<pre class="src src-python">people = {
    "first": ["Corey", 'Jane', 'John'], 
    "last": ["Schafer", 'Doe', 'Doe'], 
    "email": ["CoreyMSchafer@gmail.com", 'JaneDoe@email.com', 'JohnDoe@email.com'],
    "employee id": ["2022B001","2022B002","2022B003"]
}

import pandas as pd

df = pd.DataFrame(people)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
</div>
