program/Notes_pandas.org
** Add column 
#+begin_src python 
df['full name'] = df['first'] + ' ' + df['last']
df
#+end_src
|    | first   | last    | email                   | employee id   | full name    |
|----+---------+---------+-------------------------+---------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      | Corey Schafer |
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      | Jane Doe      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      | John Doe      |
** Remove column
#+begin_src python 
df.drop(columns=[ 'last','full name'], inplace=True)
#+end_src

|    | first   | email                   | employee id   |
|----+---------+-------------------------+---------------|
|  0 | Corey   | CoreyMSchafer@gmail.com | 2022B001      |
|  1 | Jane    | JaneDoe@email.com       | 2022B002      |
|  2 | John    | JohnDoe@email.com       | 2022B003      |
#+begin_src python 
df.drop(columns=['first', 'last'], inplace=True)
#+end_src

|    | email                   | employee id   | full name     |
|----+-------------------------+---------------+---------------|
|  0 | CoreyMSchafer@gmail.com | 2022B001      | Corey Schafer |
|  1 | JaneDoe@email.com       | 2022B002      | Jane Doe      |
|  2 | JohnDoe@email.com       | 2022B003      | John Doe      |
** Creating column
#+begin_src python
 df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
#+end_src

|    | email                   | employee id   | full name     | first   | last    |
|----+-------------------------+---------------+---------------+---------+---------|
|  0 | CoreyMSchafer@gmail.com | 2022B001      | Corey Schafer | Corey   | Schafer |
|  1 | JaneDoe@email.com       | 2022B002      | Jane Doe      | Jane    | Doe     |
|  2 | JohnDoe@email.com       | 2022B003      | John Doe      | John    | Doe     |

** Add new row in dataframe using append 
#+begin_src python 
df.append({'first': 'Tony'}, ignore_index=True) # NOTE this method is deprecated in future version use pandas.concat 
#+end_src
** Add two dataframe in row using append
#+begin_src python 
people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)
#+end_src
|    | email              | full name    | first   | last   |
|----+--------------------+--------------+---------+--------|
|  0 | IronMan@avenge.com | Tony Stark   | Tony    | Stark  |
|  1 | Cap@avenge.com     | Steve Rogers | Steve   | Rogers |

#+begin_src python 
df.append(df2, ignore_index=True, sort=False)
#+end_src

|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |
|  3 | Tony    | Stark   | IronMan@avenge.com      | nan           |
|  4 | Steve   | Rogers  | Cap@avenge.com          | nan           |
** Remove row with index no or by value 
#+begin_src python 
df.drop(index=4)
#+end_src
|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  1 | Jane    | Doe     | JaneDoe@email.com       | 2022B002      |
|  2 | John    | Doe     | JohnDoe@email.com       | 2022B003      |
|  3 | Tony    | Stark   | IronMan@avenge.com      | nan           |
#+begin_src python 
filt = df['last'] == 'Doe'
df =df.drop(index=df[filt].index)
#+end_src

|    | first   | last    | email                   | employee id   |
|----+---------+---------+-------------------------+---------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com | 2022B001      |
|  3 | Tony    | Stark   | IronMan@avenge.com      | nan           |
|  4 | Steve   | Rogers  | Cap@avenge.com          | nan           |

