program/Notes_pandas.html
<div id="outline-container-org46bf229" class="outline-3">
<h3 id="org46bf229">Add column</h3>
<div class="outline-text-3" id="text-org46bf229">
<div class="org-src-container">
<pre class="src src-python">df['full name'] = df['first'] + ' ' + df['last']
df
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">full name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
<td class="org-left">Corey Schafer</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
<td class="org-left">Jane Doe</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
<td class="org-left">John Doe</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc76b444" class="outline-3">
<h3 id="orgc76b444">Remove column</h3>
<div class="outline-text-3" id="text-orgc76b444">
<div class="org-src-container">
<pre class="src src-python">df.drop(columns=[ 'last','full name'], inplace=True)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python">df.drop(columns=['first', 'last'], inplace=True)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">full name</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
<td class="org-left">Corey Schafer</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
<td class="org-left">Jane Doe</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
<td class="org-left">John Doe</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgfab6a1f" class="outline-3">
<h3 id="orgfab6a1f">Creating column</h3>
<div class="outline-text-3" id="text-orgfab6a1f">
<div class="org-src-container">
<pre class="src src-python">df[['first', 'last']] = df['full_name'].str.split(' ', expand=True)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
<th scope="col" class="org-left">full name</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
<td class="org-left">Corey Schafer</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
<td class="org-left">Jane Doe</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
<td class="org-left">John Doe</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org72af373" class="outline-3">
<h3 id="org72af373">Add new row in dataframe using append</h3>
<div class="outline-text-3" id="text-org72af373">
<div class="org-src-container">
<pre class="src src-python">df.append({'first': 'Tony'}, ignore_index=True) # NOTE this method is deprecated in future version use pandas.concat 
</pre>
</div>
</div>
</div>
<div id="outline-container-org0ade523" class="outline-3">
<h3 id="org0ade523">Add two dataframe in row using append</h3>
<div class="outline-text-3" id="text-org0ade523">
<div class="org-src-container">
<pre class="src src-python">people = {
    'first': ['Tony', 'Steve'], 
    'last': ['Stark', 'Rogers'], 
    'email': ['IronMan@avenge.com', 'Cap@avenge.com']
}
df2 = pd.DataFrame(people)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">full name</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">IronMan@avenge.com</td>
<td class="org-left">Tony Stark</td>
<td class="org-left">Tony</td>
<td class="org-left">Stark</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Cap@avenge.com</td>
<td class="org-left">Steve Rogers</td>
<td class="org-left">Steve</td>
<td class="org-left">Rogers</td>
</tr>
</tbody>
</table>

<div class="org-src-container">
<pre class="src src-python">df.append(df2, ignore_index=True, sort=False)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Tony</td>
<td class="org-left">Stark</td>
<td class="org-left">IronMan@avenge.com</td>
<td class="org-left">nan</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Steve</td>
<td class="org-left">Rogers</td>
<td class="org-left">Cap@avenge.com</td>
<td class="org-left">nan</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgcdd890e" class="outline-3">
<h3 id="orgcdd890e">Remove row with index no or by value</h3>
<div class="outline-text-3" id="text-orgcdd890e">
<div class="org-src-container">
<pre class="src src-python">df.drop(index=4)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-left">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-left">2022B001</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
<td class="org-left">2022B002</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
<td class="org-left">2022B003</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Tony</td>
<td class="org-left">Stark</td>
<td class="org-left">IronMan@avenge.com</td>
<td class="org-left">nan</td>
</tr>
</tbody>
</table>
<div class="org-src-container">
<pre class="src src-python">filt = df['last'] == 'Doe'
df =df.drop(index=df[filt].index)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
<th scope="col" class="org-right">employee id</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
<td class="org-right">2022B001</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Tony</td>
<td class="org-left">Stark</td>
<td class="org-left">IronMan@avenge.com</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Steve</td>
<td class="org-left">Rogers</td>
<td class="org-left">Cap@avenge.com</td>
<td class="org-right">nan</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
