program/Notes_pandas.org
* Sorting-Data

#+begin_src python 
people = {
    'first': ['Corey', 'Jane', 'John', 'Adam'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}
import pandas as pd
df = pd.DataFrame(people)
#+end_src

|    | first   | last    | email                   |
|----+---------+---------+-------------------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com |
|  1 | Jane    | Doe     | JaneDoe@email.com       |
|  2 | John    | Doe     | JohnDoe@email.com       |
|  3 | Adam    | Doe     | A@email.com             |
** Sort by one column 
#+begin_src python 
df.sort_values(by='last', ascending=True)
#+end_src

|    | first   | last    | email                   |
|----+---------+---------+-------------------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com |
|  1 | Jane    | Doe     | JaneDoe@email.com       |
|  2 | John    | Doe     | JohnDoe@email.com       |
|  3 | Adam    | Doe     | A@email.com             |
** Sort by two column 
#+begin_src python 
df.sort_values(by=['last', 'first'], ascending=False)
#+end_src
|    | first   | last    | email                   |
|----+---------+---------+-------------------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com |
|  2 | John    | Doe     | JohnDoe@email.com       |
|  1 | Jane    | Doe     | JaneDoe@email.com       |
|  3 | Adam    | Doe     | A@email.com             |
** Sort by two column with multiple sort values 
#+begin_src python 
df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)
#+end_src
|    | first   | last    | email                   |
|----+---------+---------+-------------------------|
|  0 | Corey   | Schafer | CoreyMSchafer@gmail.com |
|  3 | Adam    | Doe     | A@email.com             |
|  1 | Jane    | Doe     | JaneDoe@email.com       |
|  2 | John    | Doe     | JohnDoe@email.com       |
+----+---------+---------+-------------------------+

#+begin_src python
df['last'].sort_values()
# 3        Doe
# 1        Doe
# 2        Doe
# 0    Schafer
# Name: last, dtype: object
#+end_src
** Example 2
#+begin_src python 
dir_name= '/media/jayradhey/myVolume/WorkSpace_Python/pandas/'
file_name='data/survey_results_public.csv'
schema_name='data/survey_results_schema.csv'
schema_path=dir_name + schema_name
file_path =  dir_name + file_name
print(file_path, schema_path)

import pandas as pd
df = pd.read_csv(file_path, index_col='Respondent') # , index_col='Respondent'
schema_df = pd.read_csv(schema_path, index_col='Column')
#+end_src

