program/Notes_pandas.html

<div id="outline-container-org5aa5660" class="outline-2">
<h2 id="org5aa5660">Sorting-Data</h2>
<div class="outline-text-2" id="text-org5aa5660">
<div class="org-src-container">
<pre class="src src-python">people = {
    'first': ['Corey', 'Jane', 'John', 'Adam'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Doe'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', 'A@email.com']
}
import pandas as pd
df = pd.DataFrame(people)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Adam</td>
<td class="org-left">Doe</td>
<td class="org-left">A@email.com</td>
</tr>
</tbody>
</table>
</div>
<div id="outline-container-org4ef05ad" class="outline-3">
<h3 id="org4ef05ad">Sort by one column</h3>
<div class="outline-text-3" id="text-org4ef05ad">
<div class="org-src-container">
<pre class="src src-python">df.sort_values(by='last', ascending=True)
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Adam</td>
<td class="org-left">Doe</td>
<td class="org-left">A@email.com</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgc447c1a" class="outline-3">
<h3 id="orgc447c1a">Sort by two column</h3>
<div class="outline-text-3" id="text-orgc447c1a">
<div class="org-src-container">
<pre class="src src-python">df.sort_values(by=['last', 'first'], ascending=False)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Adam</td>
<td class="org-left">Doe</td>
<td class="org-left">A@email.com</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-orgaa1a9ac" class="outline-3">
<h3 id="orgaa1a9ac">Sort by two column with multiple sort values</h3>
<div class="outline-text-3" id="text-orgaa1a9ac">
<div class="org-src-container">
<pre class="src src-python">df.sort_values(by=['last', 'first'], ascending=[False, True], inplace=True)
</pre>
</div>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">&#xa0;</th>
<th scope="col" class="org-left">first</th>
<th scope="col" class="org-left">last</th>
<th scope="col" class="org-left">email</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">0</td>
<td class="org-left">Corey</td>
<td class="org-left">Schafer</td>
<td class="org-left">CoreyMSchafer@gmail.com</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Adam</td>
<td class="org-left">Doe</td>
<td class="org-left">A@email.com</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-left">Jane</td>
<td class="org-left">Doe</td>
<td class="org-left">JaneDoe@email.com</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">John</td>
<td class="org-left">Doe</td>
<td class="org-left">JohnDoe@email.com</td>
</tr>
</tbody>
</table>
<p>
<del>----</del>---------<del>---------</del>--------------------&#x2013;&#x2014;+
</p>

<div class="org-src-container">
<pre class="src src-python">df['last'].sort_values()
# 3        Doe
# 1        Doe
# 2        Doe
# 0    Schafer
# Name: last, dtype: object
</pre>
</div>
</div>
</div>
