program/Notes_pandas.org
*** Sort Salary in Desending Order  based Country(in ascending Order)
#+begin_src python
df.sort_values(by=['Country', 'ConvertedComp'], ascending=[True, False], inplace=True)
df[['Country', 'ConvertedComp']].head(50) 
#+end_src

|   Respondent | Country     |   ConvertedComp |
|--------------+-------------+-----------------|
|        63129 | Afghanistan |           1e+06 |
|        50499 | Afghanistan |      153216     |
|        39258 | Afghanistan |       19152     |
|        58450 | Afghanistan |       17556     |
|         7085 | Afghanistan |       14364     |
|        22450 | Afghanistan |        7980     |
|        48436 | Afghanistan |        4464     |
|        10746 | Afghanistan |        3996     |
|         8149 | Afghanistan |        1596     |
|        29736 | Afghanistan |        1116     |
|          722 | Afghanistan |           0     |
|        28638 | Afghanistan |           0     |
|         6417 | Afghanistan |         nan     |
|         7353 | Afghanistan |         nan     |
|        12310 | Afghanistan |         nan     |
|        26340 | Afghanistan |         nan     |
|        29045 | Afghanistan |         nan     |
|        33178 | Afghanistan |         nan     |
|        37802 | Afghanistan |         nan     |
|        40000 | Afghanistan |         nan     |
|        43106 | Afghanistan |         nan     |
|        44403 | Afghanistan |         nan     |
|        45854 | Afghanistan |         nan     |
|        47110 | Afghanistan |         nan     |
|        49702 | Afghanistan |         nan     |
|        50767 | Afghanistan |         nan     |
|        51859 | Afghanistan |         nan     |
|        58760 | Afghanistan |         nan     |
|        59560 | Afghanistan |         nan     |
|        60569 | Afghanistan |         nan     |
|        60946 | Afghanistan |         nan     |
|        62168 | Afghanistan |         nan     |
|        62525 | Afghanistan |         nan     |
|        74386 | Afghanistan |         nan     |
|        80926 | Afghanistan |         nan     |
|        85715 | Afghanistan |         nan     |
|        85825 | Afghanistan |         nan     |
|        86362 | Afghanistan |         nan     |
|        86932 | Afghanistan |         nan     |
|        87091 | Afghanistan |         nan     |
|        88582 | Afghanistan |         nan     |
|        88731 | Afghanistan |         nan     |
|         2782 | Afghanistan |         nan     |
|        63019 | Afghanistan |         nan     |
|        38308 | Albania     |      187668     |
|         3787 | Albania     |      114550     |
|         9270 | Albania     |       74474     |
|         6716 | Albania     |       60000     |
|        10303 | Albania     |       57300     |
|        66280 | Albania     |       41244     |

*** Sort dataframe based on salary
#+begin_src python 
df['ConvertedComp'].nlargest(10)
#+end_src
#+begin_src 
25983    2000000.0
87896    2000000.0
22013    2000000.0
28243    2000000.0
72732    2000000.0
78151    2000000.0
80200    2000000.0
52132    2000000.0
75561    2000000.0
32250    2000000.0
Name: ConvertedComp, dtype: float64
#+end_src
#+begin_src python 
df.nsmallest(10, 'ConvertedComp')
#+end_src
#+begin_src 
Respondent
722      0.0
28638    0.0
13825    0.0
40913    0.0
30630    0.0
69049    0.0
19340    0.0
16214    0.0
29355    0.0
1685     0.0
Name: ConvertedComp, dtype: float64
#+end_src
* Grouping and Aggregates
file:./pandas-sub-doc/Pandas-Grouping-Aggregates.html
#+begin_src python 
dir_name= '/media/jayradhey/myVolume/WorkSpace_Python/pandas/'
file_name='data/survey_results_public.csv'
schema_name='data/survey_results_schema.csv'
schema_path=dir_name + schema_name
file_path =  dir_name + file_name
print(file_path, schema_path)

df = pd.read_csv(file_path, index_col='Respondent') # , index_col='Respondent'
schema_df = pd.read_csv(schema_path, index_col='Column')
#+end_src

#+begin_src python 
df.describe()
#+end_src

|       |   CompTotal | ConvertedComp | WorkWeekHrs | CodeRevHrs |     Age |
|-------+-------------+---------------+-------------+------------+---------|
| count |       55945 |         55823 |       64503 |      49790 |   79210 |
| mean  | 5.51901e+11 |        127111 |     42.1272 |    5.08431 | 30.3367 |
| std   | 7.33193e+13 |        284152 |     37.2876 |    5.51393 | 9.17839 |
| min   |           0 |             0 |           1 |          0 |       1 |
| 25%   |       20000 |       25777.5 |          40 |          2 |      24 |
| 50%   |       62000 |         57287 |          40 |          4 |      29 |
| 75%   |      120000 |        100000 |       44.75 |          6 |      35 |
| max   |       1e+16 |         2e+06 |        4850 |         99 |      99 |

