program/Notes_pandas.html
<div id="outline-container-org6023230" class="outline-3">
<h3 id="org6023230">Example 2</h3>
<div class="outline-text-3" id="text-org6023230">
<div class="org-src-container">
<pre class="src src-python">dir_name= '/media/jayradhey/myVolume/WorkSpace_Python/pandas/'
file_name='data/survey_results_public.csv'
schema_name='data/survey_results_schema.csv'
schema_path=dir_name + schema_name
file_path =  dir_name + file_name
print(file_path, schema_path)

import pandas as pd
df = pd.read_csv(file_path, index_col='Respondent') # , index_col='Respondent'
schema_df = pd.read_csv(schema_path, index_col='Column')
</pre>
</div>
</div>

<div id="outline-container-org489c497" class="outline-4">
<h4 id="org489c497">Sort Salary in Desending Order  based Country(in ascending Order)</h4>
<div class="outline-text-4" id="text-org489c497">
<div class="org-src-container">
<pre class="src src-python">df.sort_values(by=['Country', 'ConvertedComp'], ascending=[True, False], inplace=True)
df[['Country', 'ConvertedComp']].head(50) 
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Respondent</th>
<th scope="col" class="org-left">Country</th>
<th scope="col" class="org-right">ConvertedComp</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">63129</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">1e+06</td>
</tr>

<tr>
<td class="org-right">50499</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">153216</td>
</tr>

<tr>
<td class="org-right">39258</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">19152</td>
</tr>

<tr>
<td class="org-right">58450</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">17556</td>
</tr>

<tr>
<td class="org-right">7085</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">14364</td>
</tr>

<tr>
<td class="org-right">22450</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">7980</td>
</tr>

<tr>
<td class="org-right">48436</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">4464</td>
</tr>

<tr>
<td class="org-right">10746</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">3996</td>
</tr>

<tr>
<td class="org-right">8149</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">1596</td>
</tr>

<tr>
<td class="org-right">29736</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">1116</td>
</tr>

<tr>
<td class="org-right">722</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">28638</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">0</td>
</tr>

<tr>
<td class="org-right">6417</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">7353</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">12310</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">26340</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">29045</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">33178</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">37802</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">40000</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">43106</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">44403</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">45854</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">47110</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">49702</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">50767</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">51859</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">58760</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">59560</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">60569</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">60946</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">62168</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">62525</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">74386</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">80926</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">85715</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">85825</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">86362</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">86932</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">87091</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">88582</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">88731</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">2782</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">63019</td>
<td class="org-left">Afghanistan</td>
<td class="org-right">nan</td>
</tr>

<tr>
<td class="org-right">38308</td>
<td class="org-left">Albania</td>
<td class="org-right">187668</td>
</tr>

<tr>
<td class="org-right">3787</td>
<td class="org-left">Albania</td>
<td class="org-right">114550</td>
</tr>

<tr>
<td class="org-right">9270</td>
<td class="org-left">Albania</td>
<td class="org-right">74474</td>
</tr>

<tr>
<td class="org-right">6716</td>
<td class="org-left">Albania</td>
<td class="org-right">60000</td>
</tr>

<tr>
<td class="org-right">10303</td>
<td class="org-left">Albania</td>
<td class="org-right">57300</td>
</tr>

<tr>
<td class="org-right">66280</td>
<td class="org-left">Albania</td>
<td class="org-right">41244</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org33ae2c9" class="outline-4">
<h4 id="org33ae2c9">Sort dataframe based on salary</h4>
<div class="outline-text-4" id="text-org33ae2c9">
<div class="org-src-container">
<pre class="src src-python">df['ConvertedComp'].nlargest(10)
</pre>
</div>
<pre class="example">
25983    2000000.0
87896    2000000.0
22013    2000000.0
28243    2000000.0
72732    2000000.0
78151    2000000.0
80200    2000000.0
52132    2000000.0
75561    2000000.0
32250    2000000.0
Name: ConvertedComp, dtype: float64
</pre>
<div class="org-src-container">
<pre class="src src-python">df.nsmallest(10, 'ConvertedComp')
</pre>
</div>
<pre class="example">
Respondent
722      0.0
28638    0.0
13825    0.0
40913    0.0
30630    0.0
69049    0.0
19340    0.0
16214    0.0
29355    0.0
1685     0.0
Name: ConvertedComp, dtype: float64
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgdf9a8a5" class="outline-2">
<h2 id="orgdf9a8a5">Grouping and Aggregates</h2>
<div class="outline-text-2" id="text-orgdf9a8a5">
<p>
<a href="./pandas-sub-doc/Pandas-Grouping-Aggregates.html">./pandas-sub-doc/Pandas-Grouping-Aggregates.html</a>
</p>
<div class="org-src-container">
<pre class="src src-python">dir_name= '/media/jayradhey/myVolume/WorkSpace_Python/pandas/'
file_name='data/survey_results_public.csv'
schema_name='data/survey_results_schema.csv'
schema_path=dir_name + schema_name
file_path =  dir_name + file_name
print(file_path, schema_path)

df = pd.read_csv(file_path, index_col='Respondent') # , index_col='Respondent'
schema_df = pd.read_csv(schema_path, index_col='Column')
</pre>
</div>

<div class="org-src-container">
<pre class="src src-python">df.describe()
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">&#xa0;</th>
<th scope="col" class="org-right">CompTotal</th>
<th scope="col" class="org-right">ConvertedComp</th>
<th scope="col" class="org-right">WorkWeekHrs</th>
<th scope="col" class="org-right">CodeRevHrs</th>
<th scope="col" class="org-right">Age</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">count</td>
<td class="org-right">55945</td>
<td class="org-right">55823</td>
<td class="org-right">64503</td>
<td class="org-right">49790</td>
<td class="org-right">79210</td>
</tr>

<tr>
<td class="org-left">mean</td>
<td class="org-right">5.51901e+11</td>
<td class="org-right">127111</td>
<td class="org-right">42.1272</td>
<td class="org-right">5.08431</td>
<td class="org-right">30.3367</td>
</tr>

<tr>
<td class="org-left">std</td>
<td class="org-right">7.33193e+13</td>
<td class="org-right">284152</td>
<td class="org-right">37.2876</td>
<td class="org-right">5.51393</td>
<td class="org-right">9.17839</td>
</tr>

<tr>
<td class="org-left">min</td>
<td class="org-right">0</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-left">25%</td>
<td class="org-right">20000</td>
<td class="org-right">25777.5</td>
<td class="org-right">40</td>
<td class="org-right">2</td>
<td class="org-right">24</td>
</tr>

<tr>
<td class="org-left">50%</td>
<td class="org-right">62000</td>
<td class="org-right">57287</td>
<td class="org-right">40</td>
<td class="org-right">4</td>
<td class="org-right">29</td>
</tr>

<tr>
<td class="org-left">75%</td>
<td class="org-right">120000</td>
<td class="org-right">100000</td>
<td class="org-right">44.75</td>
<td class="org-right">6</td>
<td class="org-right">35</td>
</tr>

<tr>
<td class="org-left">max</td>
<td class="org-right">1e+16</td>
<td class="org-right">2e+06</td>
<td class="org-right">4850</td>
<td class="org-right">99</td>
<td class="org-right">99</td>
</tr>
</tbody>
</table>
</div>
</div>
