program/Notes_pandas.html

<div id="outline-container-org09328da" class="outline-2">
<h2 id="org09328da">Cleaning-Data</h2>
<div class="outline-text-2" id="text-org09328da">
<p>
Snipped <a href="./pandas-sub-doc/Pandas-Cleaning-Data.html">./pandas-sub-doc/Pandas-Cleaning-Data.html</a>
Stackoverflow <a href="./pandas-sub-doc/Pandas-Cleaning-Data-stackoverflow.html">./pandas-sub-doc/Pandas-Cleaning-Data-stackoverflow.html</a>
</p>
</div>
</div>
<div id="outline-container-org081a353" class="outline-2">
<h2 id="org081a353">pandas with datetime</h2>
<div class="outline-text-2" id="text-org081a353">
<p>
<a href="https://stackoverflow.com/questions/26763344/convert-pandas-column-to-datetime">https://stackoverflow.com/questions/26763344/convert-pandas-column-to-datetime</a>
</p>

<div class="org-src-container">
<pre class="src src-python">raw_data["date"] =  pd.to_datetime(raw_data["data"], format='%d%b%Y:%H:%M:%S.%f')
# Note: the format argument isn't required. to_datetime is smart. Go ahead and try it without trying to match your data


# If more than one colum 
df[["col1", "col2", "col3"]] = df[["col1", "col2", "col3"]].apply(pd.to_datetime)

# TO remove the timezone from the dataframe

df["date"] =  pd.to_datetime(df["date"])
df.set_index("date",inplace=True)
df.index = pd.to_datetime(df.index)      # convert col='date' to datetime object
df =df.tz_localize(None)                 # remove timezone 

</pre>
</div>

<p>
<a href="./pandas-sub-doc/Datetime-Timeseries.html">./pandas-sub-doc/Datetime-Timeseries.html</a>
</p>
</div>
</div>
<div id="outline-container-org02a7e69" class="outline-2">
<h2 id="org02a7e69"><span class="todo TODO">TODO</span> Join</h2>
<div class="outline-text-2" id="text-org02a7e69">
</div>
<div id="outline-container-orge300cf6" class="outline-3">
<h3 id="orge300cf6">Inner Join</h3>
</div>
<div id="outline-container-org6ea1312" class="outline-3">
<h3 id="org6ea1312">Outer Join</h3>
</div>
<div id="outline-container-org7427327" class="outline-3">
<h3 id="org7427327">Right Join</h3>
</div>
<div id="outline-container-orgc76c36d" class="outline-3">
<h3 id="orgc76c36d">Left Join</h3>
</div>
</div>
<div id="outline-container-org18adf99" class="outline-2">
<h2 id="org18adf99"><span class="todo TODO">TODO</span> Horizontal Join</h2>
<div class="outline-text-2" id="text-org18adf99">
</div>
<div id="outline-container-orgd2cd8e3" class="outline-3">
<h3 id="orgd2cd8e3"><span class="todo TODO">TODO</span> pandas append</h3>
<div class="outline-text-3" id="text-orgd2cd8e3">
<div class="org-src-container">
<pre class="src src-python">def historical_data(ticker,from_date,to_date,interval):
    df = pd.DataFrame()   
    # print(from_date)
    # print(to_date)
    # print(interval_limit[interval])
    interval_limit = {'minute': 60, '3minute':100, '5minute':100,'10minute':100,'15minute':200,'30minute':200,'60minute':400,'day':2000}
    # print(interval_limit['minute'])
    kite_limit = interval_limit[interval]
    while True:
	if from_date &gt;= (to_date - dt.timedelta(kite_limit)):                     #if from_date is within the 60 days limit
	    df_temp = fetchOHLC_by_date(ticker,interval,from_date,to_date)
	    df = df.append(df_temp)
    #         df.append(pd.DataFrame(kite.historical_data(ticker, from_date, to_date, interval)))
	    break
	else:                                                            #if from_date has more than 60 days limit
	    to_date_new = from_date + dt.timedelta(kite_limit)
	    df_temp = fetchOHLC_by_date(ticker,interval,from_date,to_date)
	    df = df.append(df_temp)
	    from_date = to_date_new

    return df
display(historical_data(ticker,from_date,to_date,interval))
</pre>
</div>

<blockquote>
<p>
/tmp/ipykernel<sub>53393</sub>/823271065.py:12: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead. <br />
  df.append(df<sub>temp</sub>)
</p>
</blockquote>
</div>
</div>
<div id="outline-container-org450809f" class="outline-3">
<h3 id="org450809f">pandas concat</h3>
<div class="outline-text-3" id="text-org450809f">
<p>
<a href="https://brettromero.com/pandas-append-and-concat/">https://brettromero.com/pandas-append-and-concat/</a>
</p>
<pre class="example">
df_new=pd.concat([df_new,df_temp]) # df_new.append(df_temp, sort=True)
</pre>

<div class="org-src-container">
<pre class="src src-python">import yfinance as yf
import pandas as pd
# get ohlcv data for any ticker by start date and end date
data_1 = yf.download("MSFT", start="2020-04-01", end="2020-04-15")
#display(data_1)

data_2 = yf.download("MSFT", start="2020-04-16", end="2020-04-30")
#display(data_2)


data = pd.concat([data_1, data_2])
#display(data)
</pre>
</div>


<pre class="example">

</pre>
</div>
</div>
</div>
<div id="outline-container-org93ea48f" class="outline-2">
<h2 id="org93ea48f"><span class="todo TODO">TODO</span> Copy or shallow copy</h2>
<div class="outline-text-2" id="text-org93ea48f">
<p>
by default pandas dataframe '=' will not create new object memory but the new object will use the old object which it is assigned to. <br />
Inorder to manupulate the data without effecting  the original dataframe we need to copy the data object in seperate memory using copy method
</p>
<pre class="example">
df = historialData['FB'].copy()
</pre>
</div>
</div>

<div id="outline-container-orgd716fe3" class="outline-2">
<h2 id="orgd716fe3">Resampling</h2>
<div class="outline-text-2" id="text-orgd716fe3">
<p>
<a href="https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases">https://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases</a>
</p>


<p>
<a href="https://stackoverflow.com/questions/61605415/how-can-we-resample-ohlcv-1-minute-pandas-dataframe-into-a-5-minute-dataframe">https://stackoverflow.com/questions/61605415/how-can-we-resample-ohlcv-1-minute-pandas-dataframe-into-a-5-minute-dataframe</a>
</p>

<p>
<a href="https://www.geeksforgeeks.org/python-pandas-dataframe-resample/">https://www.geeksforgeeks.org/python-pandas-dataframe-resample/</a>
</p>
<div class="org-src-container">
<pre class="src src-python"># I just copied your top table here to make the df
df = pd.read_clipboard(sep=r"[ ]{2,}")
df = df.set_index(pd.DatetimeIndex(df['date']))

print(df)

    date    Open    High    Low Close   Volume
date                        
2020-04-27 09:31:00 2020-04-27 09:31:00 10.5300 10.5300 10.4100 10.4458 1408654.0
2020-04-27 09:32:00 2020-04-27 09:32:00 10.4450 10.4450 10.3810 10.4100 469467.0
2020-04-27 09:33:00 2020-04-27 09:33:00 10.4000 10.4100 10.3470 10.3766 305665.0
2020-04-27 09:34:00 2020-04-27 09:34:00 10.3742 10.4000 10.3600 10.3850 127815.0
2020-04-27 09:35:00 2020-04-27 09:35:00 10.3850 10.4000 10.3700 10.3714 125987.0
2020-04-27 09:36:00 2020-04-27 09:36:00 10.3700 10.4100 10.3500 10.3500 248228.0
2020-04-27 09:37:00 2020-04-27 09:37:00 10.3500 10.3850 10.3500 10.3570 130435.0
2020-04-27 09:38:00 2020-04-27 09:38:00 10.3600 10.3600 10.3000 10.3000 250145.0
2020-04-27 09:39:00 2020-04-27 09:39:00 10.3000 10.3299 10.2800 10.2999 277293.0
2020-04-27 09:40:00 2020-04-27 09:40:00 10.2950 10.2950 10.2200 10.2200 333785.0
2020-04-27 09:41:00 2020-04-27 09:41:00 10.2280 10.2300 10.1500 10.1550 292010.0
2020-04-27 09:42:00 2020-04-27 09:42:00 10.1597 10.2100 10.1500 10.1900 314917.0
2020-04-27 09:43:00 2020-04-27 09:43:00 10.1890 10.2180 10.1800 10.2114 293827.0
2020-04-27 09:44:00 2020-04-27 09:44:00 10.2200 10.2500 10.1900 10.1902 317016.0
2020-04-27 09:45:00 2020-04-27 09:45:00 10.1950 10.2100 10.1342 10.1396 296248.0


df_rs = df.resample('5T', label='right', closed='right').agg({'Open':'first',
								 'High':'max',
								 'Low':'min',
								 'Close':'last',
								 'Volume':'sum'})

print(df_rs)

    Open    High    Low Close   Volume
date                    
2020-04-27 09:35:00 10.530  10.53   10.3470 10.3714 2437588.0
2020-04-27 09:40:00 10.370  10.41   10.2200 10.2200 1239886.0
2020-04-27 09:45:00 10.228  10.25   10.1342 10.1396 1514018.0
</pre>
</div>
</div>
</div>
<div id="outline-container-org4187643" class="outline-2">
<h2 id="org4187643">Aggreagtes for ohlc</h2>
<div class="outline-text-2" id="text-org4187643">
<div class="org-src-container">
<pre class="src src-python">df = pd.read_csv('CRUDEOIL_MCX.csv', names=['last_price','date'],index_col=1,parse_dates=True)
df = pd.DataFrame(df)
data=df['last_price'].resample('1min').ohlc()
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Karthik</p>
<p class="date">Created: 2023-03-16 Thu 11:42</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
